{
    "qualityModel": false,
    "transactionsConfiguration": false,
    "name": "com.castsoftware.uc.analytics.aar_engine",
    "href": "AIP/extensions/com.castsoftware.uc.analytics.aar_engine",
    "title": "Advanced Analytics Reporting (AAR) engine",
    "description": "AAR solution is built upon Apache Drill and is fundamentally a query engine that support a variety of NoSQL databases and file systems, including HBase, MongoDB, Amazon S3, Azure Blob Storage, Google Cloud Storage, Swift, NAS and local files. A single query can join data from multiple data stores. For example, you can join CAST Rest API JSON response, to text file output to a psql query to a Central Schema to a user profile collection in MongoDB.\nLeveraging Drill JSON data model AAR support queries on complex/nested data as well as rapidly evolving structures. AAR/Drill provides intuitive extensions to SQL so that you can easily query complex data.\nAAR supports:\nA. Self-service raw data exploration: You can explore and analyze CAST raw data sets of any complexity as they are produced, using familiar BI tools. You can now use SQL to natively query and manipulate complex/semi-structured CAST Rest API JSON data. Blend Rest API query with traditional CAST storage and dashboard services SQL query to gain new insights and more effectively determine what is useful and what is not, without spending lots of IT cycle.\nB. Business intelligence on CAST analytics:  Specialized ANSI SQL extensions allow for instant flattening and native querying of even the most complex nested data. You can perform secure, concurrent, low latency SQL analytics your IT data. You can do instant joins across CAST and your own data to create blended data report and dashboard that highlight correlation and interdependency between CAST analytics and your own business and operational metrics.\nExtension required: MS PowerShell\" version=\"0.0\" and Apache Drill\" version=\"1.6\"",
    "versions": {
        "name": "versions from latest to oldest",
        "href": "AIP/extensions/com.castsoftware.uc.analytics.aar_engine/versions"
    }
}
