{
    "id": "STIG-V-222535",
    "name": "The application must disable device identifiers after 35 days of inactivity unless a cryptographic certificate is used for authentication.",
    "href": "Echo/quality-standards/STIG-V5/items/STIG-V-222535",
    "url": "https://www.stigviewer.com/stig/application_security_and_development/2020-09-30/findingV-222535",
    "description": "Device identifiers are used to identify hardware devices that interact with the application much like a user account is used to identify an application user.  Examples of hardware devices include but are not limited to mobile phones, application gateways or other types of smart hardware.  \n\nThis requirement does not apply to individual application user accounts.  \n\nThis requirement is not applicable to shared information system accounts, application groups, roles (e.g., guest and anonymous accounts) that are used by the application itself in order to function.  Care must be taken to not disable identifiers that are used by the application in order to function.\n\nInactive device identifiers pose a risk to systems and applications. Attackers that are able to exploit an inactive identifier can potentially obtain and maintain undetected access to the application. \n\nApplications need to track periods of device inactivity and disable the device identifier after 35 days of inactivity.  This is usually accomplished by disabling the account used by the device to access the application.\n\nApplications that utilize cryptographic certificates for device authentication may use the expiration date assigned to the certificate to meet this requirement with the understanding that the certificate is created and managed in accordance with DoD PKI policy and can be revoked by a trusted CA.\n\nTo avoid having to build complex device management capabilities directly into their application, developers should leverage the underlying OS or other account management infrastructure (AD, LDAP) that is already in place within the organization and meets organizational user account management requirements.\n\nApplications are encouraged to utilize a centralized data store such as Active Directory or LDAP to offload device management requirements and ensure compliance with policy requirements.",
    "isoPatterns": null,
    "count": 0,
    "qualityRules": null
}
