{
    "id": 1003196,
    "name": "Avoid switch statement without a default case (Flex)",
    "href": "AIP/quality-rules/1003196",
    "critical": false,
    "maxWeight": 5,
    "description": "This QR reports artifacts with switch statements without default case.",
    "output": "This QR reports artifacts with switch statements without default case. It provides following information:\n- Artifact full name",
    "rationale": "Switch statements should have a default label in order to detect corner cases.",
    "remediation": "Add default case to every switch statement.",
    "total": "Number of artifacts",
    "businessCriteria": [
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66069,
            "name": "Programming Practices - Unexpected Behavior",
            "weight": 5,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1007000,
            "name": "Flex",
            "href": "AIP/technologies/1007000"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCMM-MNT-1",
            "name": "Control Flow Transfer Control Element outside Switch Block",
            "url": null,
            "description": "Objective\nAvoid the unconditional transfer of control flow outside of switch structures\n\nConsequence\nSoftware that does not follow the principles of structured programming degrades comprehensibility\n\nMeasure Element\nNumber of instances where an unconditional transfer of control is located outside the branching based on the value of a storable element\n\n"
        },
        {
            "standard": "CWE",
            "id": "CWE-478",
            "name": "Missing Default Case in Switch Statement",
            "url": "https://cwe.mitre.org/data/definitions/478.html",
            "description": "The code does not have a default case in a switch statement, which might lead to complex logical errors and resultant weaknesses."
        },
        {
            "standard": "STIG-V4R8",
            "id": "STIG-V-70385",
            "name": "The application development team must follow a set of coding standards.",
            "url": null,
            "description": "Coding standards are guidelines established by the development team or individual developers that recommend programming style, practices and methods.  The coding standards employed will vary based upon the programming language that is being used to develop the application and the development team.\n\nCoding standards often cover the use of white space characters, variable naming conventions, function naming conventions, and comment styles.  Implementing coding standards provides many benefits to the development process.  These benefits include code readability, coding consistency among both individual and teams of developers as well as ease of code integration.  \n\nThe following are examples of what will typically be in a coding standards document.  This list is an example of what one can expect to find in typical coding standard documents and is not a comprehensive list:\n\n- Indent style conventions\n- Naming conventions\n- Line length conventions\n- Comment conventions\n- Programming best practices\n- Programming style conventions\n\nCoding standards allow developers to quickly adapt to code which has been developed by various members of a development team.  Coding standards are useful in the code review process as well as in situations where a team member leaves and duties must then be assigned to another team member.  \n\nCode conforming to a standard format is easier to read, especially if someone other than the original developer is examining the code.  In addition, formatted code can be debugged and corrected faster than unformatted code.\n\nIntroducing coding standards can help increase the consistency, reliability, and security of the application by ensuring common programming structures and tasks are handled by similar methods, as well as, reducing the occurrence of common logic errors."
        }
    ],
    "parameters": [
        {
            "name": "FlexMetricName",
            "description": "FlexMetricName",
            "technologies": [
                {
                    "id": 1007000,
                    "name": "Flex",
                    "href": "AIP/technologies/1007000",
                    "values": [
                        "adobe.ac.pmd.rules.switchrules.SwitchStatementsShouldHaveDefault"
                    ]
                }
            ]
        }
    ],
    "thresholds": [
        95.0,
        98.0,
        99.0,
        100.0
    ]
}
