{
    "id": 1007280,
    "name": "Avoid System Information Leakage (PHP)",
    "href": "AIP/quality-rules/1007280",
    "critical": false,
    "maxWeight": 5,
    "associatedValueName": "Reasoning",
    "description": "An information leakage vulnerability occurs when confidential information about the web server's setup is leaked to the application's user.",
    "output": "This report lists all artifacts that cause system information leakage. \nThis QR provides the following information:\nArtifact Full Name",
    "rationale": "Although information leakage might not be exploitable, it can help an attacker to prepare other attacks. The affected code leaks information about the system that allows an attacker to learn about used software versions or installation paths.",
    "reference": "https://cwe.mitre.org/data/definitions/214.html",
    "remediation": "Remove information leakage (typically phpinfo() function in PHP).",
    "total": "Number of Artifacts",
    "alternativeName": "Avoid System Information Leakage (PHP)",
    "businessCriteria": [
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66064,
            "name": "Secure Coding - Weak Security Features",
            "weight": 5,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1017000,
            "name": "PHP",
            "href": "AIP/technologies/1017000"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CWE",
            "id": "CWE-214",
            "name": "Information Exposure Through Process Environment",
            "url": "https://cwe.mitre.org/data/definitions/214.html",
            "description": "A process is invoked with sensitive arguments, environment variables, or other elements that can be seen by other processes on the operating system."
        },
        {
            "standard": "STIG-V4R8",
            "id": "STIG-V-69329",
            "name": "The application must enforce approved authorizations for logical access to information and system resources in accordance with applicable access control policies.",
            "url": null,
            "description": "To mitigate the risk of unauthorized access to sensitive information by entities that have been issued certificates by DoD-approved PKIs, all DoD systems (e.g., networks, web servers, and web portals) must be properly configured to incorporate access control methods that do not rely solely on the possession of a certificate for access. \n\nSuccessful authentication must not automatically give an entity access to a restricted asset or security boundary.\n\nAuthorization procedures and controls must be implemented to ensure each authenticated entity also has a validated and current authorization.\n\nAuthorization is the process of determining whether an entity, once authenticated, is permitted to access a specific asset.\n\nInformation systems use access control policies and enforcement mechanisms to implement this requirement.\n\nAccess control policies include identity-based policies, role-based policies, and attribute-based policies.\n\nAccess enforcement mechanisms include access control lists, access control matrices, and cryptography.\n\nThese policies and mechanisms must be employed by the application to control access between users (or processes acting on behalf of users) and objects (e.g., devices, files, records, processes, programs, and domains) in the information system.\n\nThis requirement is applicable to access control enforcement applications (e.g., authentication servers) and other applications that perform information and system access control functions."
        }
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
