{
    "id": 1007264,
    "name": "Avoid unrestricted file upload (PHP)",
    "href": "AIP/quality-rules/1007264",
    "critical": false,
    "maxWeight": 5,
    "associatedValueName": "Reasoning",
    "description": "A file upload is an often misused feature that allows users to upload malicious files to the web server.",
    "output": "This report lists all artifacts that allow unrestricted file upload. \nThis QR provides the following information:\nArtifact Full Name",
    "rationale": "a remote code execution can be achieved by uploading a PHP file into the document root. Often, the file extension plays an important role and depending on the web server's configuration, different file extensions such as .php, .php4, or .php.zzz are passed to the PHP interpreter. Furthermore, uploading a .htaccess file can lead to remote code execution and uploading .htm, .html, .swf, or .svg files can lead to persistent cross-site scripting.",
    "reference": "https://cwe.mitre.org/data/definitions/434.html",
    "remediation": "certain built-in functions used to ensure the presence of an image, such as getimagesize(), can be bypassed. Although it is stronly recommended, that uploaded files are not stored in the document root and the file's name is not in control of the user..",
    "total": "Number of Artifacts",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66062,
            "name": "Secure Coding - Input Validation",
            "weight": 5,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1017000,
            "name": "PHP",
            "href": "AIP/technologies/1017000"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CWE",
            "id": "CWE-434",
            "name": "Unrestricted Upload of File with Dangerous Type",
            "url": "https://cwe.mitre.org/data/definitions/434.html",
            "description": "The software allows the attacker to upload or transfer files of dangerous types that can be automatically processed within the product's environment."
        },
        {
            "standard": "STIG-V4R8",
            "id": "STIG-V-70409",
            "name": "The designer must ensure uncategorized or emerging mobile code is not used in applications.",
            "url": null,
            "description": "By definition, mobile code is software obtained from remote systems outside the enclave boundary, transferred across a network, and then downloaded and executed on a local system without explicit installation or execution by the recipient.  \n\nFor a complete list of mobile code categorizations, refer to the overview document included with this STIG.\nCategorized mobile code includes but is not limited to:\n\n- ActiveX\n- Windows Scripting Host when used as mobile code\n- Unix Shell Scripts when used as mobile code\n- DOS batch scripts when used as mobile code\n- Java applets and other Java mobile code\n- Visual Basic for Applications (VBA)\n- LotusScript\n- PerfectScript\n- Postscript\n- JavaScript (including Jscript and ECMAScript variants)\n- VBScript\n- Portable Document Format (PDF)\n- Shockwave/Flash\n- Rich Internet Applications\n\nThe following technologies are not currently designated as mobile code:\n\n- XML\n- SMIL\n- QuickTime\n- VRML (exclusive of any associated Java applets or JavaScript scripts)\n\nThe following are outside the scope of the mobile code requirements:\n\n- Scripts and applets embedded in or linked to web pages and executed in the context of the web server.  Examples of this are Java servlets, Java Server pages, CGI, Active Server Pages, CFML, PHP, SSI, server-side JavaScript, server-side LotusScript.\n- Local programs and command scripts \n- Distributed object-oriented programming systems (e.g., CORBA, DCOM).\n- Software patches, updates, including self-extracting updates - software updates that must be invoked explicitly by the user are outside the mobile code policy.  Examples of technologies in this area include: Netscape SmartUpdate, Microsoft Windows Update, Netscape web browser plug-ins and Linux.\n\nIf other types of mobile code technologies are present that are not listed here, a written waiver must be granted by the CIO (allowing use of emerging mobile code technology). Also uncategorized mobile code must be submitted for AO approval."
        }
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
