{
    "id": 1050022,
    "name": "Avoid using deprecated SSL protocol (Objective-C)",
    "href": "AIP/quality-rules/1050022",
    "critical": true,
    "associatedValueName": "Number of violation occurrences",
    "description": "The following SSL protocols options kSSLProtocol2, kSSLProtocol3Only, kSSLProtocol1Only, kSSLProtocolAll are deprecated and must not be used in an iOS application.",
    "output": "This report lists all uses of kSSLProtocol2, kSSLProtocol3Only, kSSLProtocol1Only and kSSLProtocolAll options.\nAssociated to each violation, the following information is provided:\n- The number of violation occurrences\n- Bookmarks for violation occurrences found in the source code",
    "rationale": "Mobile apps that communicate over the Internet often fail to properly implement SSL/TLS, if they\nimplement it at all. These failures could leave users’ communications open to interception and even\nsession hijacking. Using SSL/TLS properly involves careful checking of the server’s certificate chain. Thus,\nan app or library that validates SSL/TLS certificates should do the following checks to ensure strong\nauthentication, confidentiality and integrity.",
    "reference": "https://developer.apple.com/security/",
    "total": "Number of Objective-C artifacts",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66063,
            "name": "Secure Coding - API Abuse",
            "weight": 8,
            "critical": true
        }
    ],
    "technologies": [
        {
            "id": 1050001,
            "name": "Objective-C",
            "href": "AIP/technologies/1050001"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCSM-CWE-327",
            "name": "Broken or Risky Cryptographic Algorithm Usage",
            "url": null,
            "description": "Objective\nAvoid failure to use vetted cryptographic libraries\n\nConsequence\nSoftware using broken or risky cryptographic algorithm incurs the risk of sensitive data being compromised\n\nMeasure Element\nNumber of instances where the application uses the cryptographic deployed component which is not part of the list of vetted cryptographic deployed components.\n\n"
        },
        {
            "standard": "CWE",
            "id": "CWE-327",
            "name": "Use of a Broken or Risky Cryptographic Algorithm",
            "url": "https://cwe.mitre.org/data/definitions/327.html",
            "description": "The use of a broken or risky cryptographic algorithm is an unnecessary risk that may result in the exposure of sensitive information."
        },
        {
            "standard": "OWASP",
            "id": "M3-2016",
            "name": "Insecure Communication",
            "url": "https://www.owasp.org/index.php/Mobile_Top_10_2016-M3-Insecure_Communication",
            "description": "Mobile applications frequently do not protect network traffic. They may use SSL/TLS during authentication but not elsewhere. This inconsistency leads to the risk of exposing data and session IDs to interception. The use of transport security does not mean the app has implemented it correctly. To detect basic flaws, observe the phone's network traffic. More subtle flaws require inspecting the design of the application and the applications configuration."
        }
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
