{
    "id": 1520552,
    "name": "SiebelReview: Joins to XM Tables",
    "href": "AIP/quality-rules/1520552",
    "critical": false,
    "maxWeight": 8,
    "associatedValueName": "Name of the XM Table",
    "description": "This rule reports Joins to XM Tables (One-to-Many Extension Tables) with an invalid configuration",
    "output": "This rule reports Joins to XM Tables with an invalid configuration. It displays:\n- Join full name\n- the associated value a reference to the _XM table object",
    "rationale": "Expert Services does not recommend Joins to _XM tables since there is the potential for more than one record to be stored on the table and data integrity issues could result.\n\nThe _XM tables are designed to have a 1:M relationship with their parent table.  In other words, the custom _XM tables are designed to store multiple values for one parent record stored on the parent table.\n\nA Join retrieves one and only one value. When a Join to an _XM table is used, it is feasible that the application would still retrieve the value from the _XM table; however, since it is possible to have more than one value related to the parent on the _XM table, it is not a reliable configuration.  Through the Join, the application is going to retrieve the first value it queries (which is usually the one with the lowest ROW_ID).  This may or may not be the correct value that it needs to select.",
    "reference": "https://docs.oracle.com/cd/B31104_02/books/ConfigApps/ConfigApps_TablesColumns6.html",
    "remediation": "The more appropriate solution is to move this data to a custom table or another standard table and build the configuration around this table.  This will prevent potential data integrity issues and upgrade conflicts.\n\nAnother alternative (in the case where it is intended that there are multiple related records) is to use a Link to display this data as either an MVG or in a child Applet.\n\nNote that this prohibition does not apply in the case where the Join is based on the Primary column of an MVG.",
    "total": "Number of added or modified Joins",
    "alternativeName": "SiebelReview: Joins to XM Tables",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "GreenIT-Index",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 8,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1520000,
            "name": "Siebel",
            "href": "AIP/technologies/1520000"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        90.0,
        95.0,
        99.0,
        100.0
    ]
}
