{
    "id": 1576,
    "name": "Use varchar2 instead of char and varchar",
    "href": "AIP/quality-rules/1576",
    "critical": false,
    "maxWeight": 2,
    "description": "You use the VARCHAR2 datatype to store variable-length character data. \nThe STRING and VARCHAR are subtypes of VARCHAR2 having the same range of values as their base type. For example, VARCHAR is just another name for VARCHAR2.\nVARCHAR is synonymous with VARCHAR2. \nHowever, in future releases of PL/SQL, to accommodate emerging SQL standards,\nVARCHAR might become a separate datatype with different comparison semantics. \n\nTherefore the recommendation from Oracle is to change char to varchar2 to save space and change varchar to varchar2 to accomodate future changes.",
    "output": "This report lists all tables, package procedures, package functions, procedures and functions not using the varchar2 type\nIt provides the following information: \n- tables, package procedure, package function, function or procedure Name, \n- tables, package procedure, package function, function or procedure full Name.",
    "rationale": "CHAR should be used for storing fix length character strings. String values will be space padded before stored on disk. If this type is used to store variable length strings, it will waste a lot of disk space.\nSo, Oracle suggests to use VARCHAR2 instead of CHAR while declaring datatype.\nAlso VARCHAR is going to be replaced by VARCHAR2 in future so Oracle recommends to replace VARCHAR by VARCHAR2.",
    "remediation": "Change CHAR columns to VARCHAR2.\nChange VARCHAR columns to VARCHAR2.",
    "total": "Number of PL/SQL objects with parameters or columns",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61018,
            "name": "Efficiency - Memory, Network and Disk Space Management",
            "weight": 2,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 139287,
            "name": "PL/SQL",
            "href": "AIP/technologies/139287"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
