{
    "id": 1600490,
    "name": "Avoid disabling Deferred Processing on Fields (PeopleSoft)",
    "href": "AIP/quality-rules/1600490",
    "critical": false,
    "maxWeight": 3,
    "description": "By default, the property is activated.",
    "output": "Failed checks give the number of pages that contain wrongly defined fields. The field name can be found in the value column",
    "rationale": "To improve online performance of internet applications, you must optimize the transmissions to the server. Optimizing transmissions improves overall processing speed and reduces the user's data entry time. Transactions that are designed using deferred mode reduce traffic to the application server but do not operate interactively.\nPeopleSoft applications can run in two different processing modes: interactive and deferred.\n-In interactive mode, when the user exits a field that has a field-level event, a transmission to the application server is performed to run that field-level event and the page is displayed again\n-Deferred mode enables you to defer many of the conditions that need server processing until running them on the application server is required or requested.",
    "remediation": "Reset the property back to Deferred (default).",
    "total": "Number of PeopleSoft Page Fields",
    "alternativeName": "Avoid disabling Deferred Processing on Fields (PeopleSoft)",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61018,
            "name": "Efficiency - Memory, Network and Disk Space Management",
            "weight": 3,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1600000,
            "name": "PeopleSoft",
            "href": "AIP/technologies/1600000"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        60.0,
        80.0,
        95.0,
        100.0
    ]
}
