{
    "id": 1600840,
    "name": "Avoid using hardcoded usernames (PeopleSoft)",
    "href": "AIP/quality-rules/1600840",
    "critical": false,
    "maxWeight": 7,
    "description": "This metric detects usage of hardcoded usernames and restrictions on how or who should see a page or depending upon the permission list to show different information on the same page.\n\nIt detects all tests (If and Evaluate) on %Oprid and %Menu, against hardcoded values.",
    "output": "This report lists all artifacts using hardcoded usernames\nIt provides the following information:\n- PeopleCode artifacts full name\n- The associated value is the number violations found in the artifact source code",
    "rationale": "The software should not have hardcoded credentials (username, password) in the application code or files.\nHard-coded credentials typically create a significant security hole that allows an attacker to bypass the authentication that has been configured by the software administrator. This hole might be difficult for the system administrator to detect. \n\nHarcoded restrictions is also difficult to detect and lower the maintainability of the application.",
    "reference": "PeopleSoft wiki - PeopleTools Security : http://peoplesoft.wikidot.com/peopletools-security\nCWE-798: Use of hard-coded credentials : http://cwe.mitre.org/data/definitions/798.html\n2011 Top 25 - Porous Defenses : https://cwe.mitre.org/data/definitions/866.html",
    "remediation": "Such bespoke behaviors and restrictions should be dealt with via configuration in Peoplesoft rather than hardcoding.",
    "sample": "If %Menu = \"ACME_MNU_ABC\" Then\nIf %oprid = \"JDOE\" Then",
    "total": "Number of PeopleSoft Events, Functions and Methods",
    "businessCriteria": [
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "AIP/business-criteria/66032"
        },
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61004,
            "name": "Architecture - OS and Platform Independence",
            "weight": 7,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1600000,
            "name": "PeopleSoft",
            "href": "AIP/technologies/1600000"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCSM-CWE-798",
            "name": "Hard-Coded Credentials Usage for Remote Authentication",
            "url": null,
            "description": "Objective\nAvoid the existence of hard-coded credentials elements\n\nConsequence\nSoftware featuring weak authentication practices incurs the risk of exposing resources and functionality to unintended actors, possibly leading to compromised sensitive information and even the execution of arbitrary code\n\nMeasure Element\nNumber of instances where a storable data element or member data element is initialized by a ‘Write’ action, transported throughout the application along the transport sequence composed of ActionElements with DataRelations relations, some of which being part of named callable and method control elements, and ultimately used in the remote resource management action ; the transport sequence is composed of assignment operations as updates to the value would not be considered as hard-coded (literal) any more.\n\n"
        },
        {
            "standard": "CWE",
            "id": "CWE-256",
            "name": "Unprotected Storage of Credentials",
            "url": "https://cwe.mitre.org/data/definitions/256.html",
            "description": "Storing a password in plaintext may result in a system compromise."
        },
        {
            "standard": "CWE",
            "id": "CWE-798",
            "name": "Use of Hard-coded Credentials",
            "url": "https://cwe.mitre.org/data/definitions/798.html",
            "description": "The software contains hard-coded credentials, such as a password or cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data."
        },
        {
            "standard": "OWASP",
            "id": "A2-2013",
            "name": "Broken Authentication and Session Management",
            "url": "https://www.owasp.org/index.php/Top_10_2013-A2-Broken Authentication and Session Management",
            "description": "Application functions related to authentication and session management are often not implemented correctly, allowing attackers to compromise passwords, keys, or session tokens, or to exploit other implementation flaws to assume other users' identities."
        },
        {
            "standard": "OWASP",
            "id": "A2-2017",
            "name": "Broken Authentication",
            "url": "https://www.owasp.org/index.php/Top_10-2017_A2-Broken_Authentication",
            "description": "Application functions related to authentication and session management are often implemented incorrectly, allowing attackers to compromise passwords, keys, or session tokens, or to exploit other implementation flaws to assume other users' identities temporarily or permanently."
        },
        {
            "standard": "PCI-DSS-V3.1",
            "id": "PCI-Requirement-2.2.4",
            "name": "Configure system security parameters to prevent misuse.",
            "url": null,
            "description": null
        }
    ],
    "parameters": [
        
    ],
    "thresholds": [
        60.0,
        80.0,
        95.0,
        100.0
    ]
}
