{
    "id": 1665542,
    "name": "PowerCenter:Avoid \"Sorted Input\" set to false for aggregators and joiners after a Sorter Transformation",
    "href": "AIP/quality-rules/1665542",
    "critical": true,
    "description": "If a Sorter Transformation is used just before an Aggregator or Joiner Transformation, it is usually necessary to set to true the property \"Sorted Input\" of these objects.\nThere are however cases where this second sort is necessary, still reported as violation :\n1. when the Sorter is used to deduplicate the set of records (to perform a distinct)\n2. when the Sort columns are not the same in the Sorter and in the Aggregator or Joiner Transformation.\n  In this later case, a review and thus a reorganisation of the Mapping or Mapplet is recommanded in order to try to suppress 1 of the 2 sort.\nOther cases exist. This rule does not filters any exceptions, as they all require functional knowledge.",
    "output": "This report lists all Workflows, Worklets, Mappings and Mapplets containing aggregator or joiner without \"Sorted Input\" parameter set to true after a Sort transformation\nIt provides the following information: \nWorkflows, Worklets, Mapping or Mapplet full name, Aggregator or Joiner full name",
    "rationale": "A Sorter Transformation is commonly used before a Joiner or an Aggregator to improve drastically performance, when sufficient real memory is available. If \"Sorted Input\" property of the Joiner or Aggregator is not checked, a second sort is performed, with CPU and memory consumption, which could have a strong impact on Performance.",
    "reference": "Informatica Velocity Methodology",
    "remediation": "Whenever possible, check \"Sorted Input\" property for Aggregator and Joiner following Sorter Transformation.",
    "total": "Total number of Workflows, Worklets, Mappings and Mapplets having aggregator and/or joiner transformations",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 9,
            "critical": true
        }
    ],
    "technologies": [
        {
            "id": 1665000,
            "name": "NO LABEL",
            "href": "AIP/technologies/1665000"
        }
    ],
    "qualityStandards": [
        
    ]
}
