{
    "id": 2026906,
    "name": "Avoid Use of Socket, ClassLoader or Thread Classes (CWE-246, CWE-578, CWE-362)",
    "href": "AIP/quality-rules/2026906",
    "critical": true,
    "associatedValueName": "Associated Value",
    "description": "Check in the code if the class Socket/Thread/ClassLoader are used",
    "output": "This report lists all Java methods that refer to Socket, ClassLoader or Thread Classes\r\nIt provides the following information:\r\n - Method full name\r\n - The associated value is the number of violation inside the violating method.",
    "rationale": "Sockets:\r\nThe J2EE standard permits the use of sockets only for the purpose of communication with legacy systems when no higher-level protocol is available. Authoring your own communication protocol requires wrestling with difficult security issues.\r\nClassLoader:\r\nThe Enterprise JavaBeans specification requires that every bean provider follow a set of programming guidelines designed to ensure that the bean will be portable and behave consistently in any EJB container. In this case, the program violates the EJB guideline: \"The enterprise bean must not attempt to create a class loader; obtain the current class loader; set the context class loader; set security manager; create a new security manager; stop the JVM; or change the input, output, and error streams.\" \r\nThread:\r\nOne of the reasons why an application server has been created is thread management that is complex to develop. It manages multiple threads for different types of components, and in order to effectively maximize security, performance and resource utilization, it requires control of the threads being run on a given machine.\r\nMore often than not, threads are created when there is no time to implement a better solution. However, the consequences can be serious in terms of security, performance and robustness.",
    "reference": "CWE-246: J2EE Bad Practices: Direct Use of Sockets\r\nhttps://cwe.mitre.org/data/definitions/246.html\r\n\r\nCWE-578: EJB Bad Practices: Use of Class Loader\r\nhttps://cwe.mitre.org/data/definitions/578.html\r\n\r\nCWE-362: Concurrent Execution using Shared Resource with Improper Synchronization ('Race Condition')\r\nhttps://cwe.mitre.org/data/definitions/362.html\r\nCWE-609: Double-Checked Locking\r\nhttps://cwe.mitre.org/data/definitions/609.html\r\nCWE-667: Improper Locking\r\nhttps://cwe.mitre.org/data/definitions/667.html",
    "remediation": "See MITRE Documentation",
    "remediationSample": "See MITRE Documentation",
    "total": "The number of identified objects that use Socket, ClassLoader or Thread Classes\r\nNumber of Java methods (to keep it simple)",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66063,
            "name": "Secure Coding - API Abuse",
            "weight": 9,
            "critical": true
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        },
        {
            "id": -11,
            "name": "JSP",
            "href": "AIP/technologies/-11"
        },
        {
            "id": -5,
            "name": "Java",
            "href": "AIP/technologies/-5"
        },
        {
            "id": 138657,
            "name": "Java Applet",
            "href": "AIP/technologies/138657"
        },
        {
            "id": 138663,
            "name": "JavaScript",
            "href": "AIP/technologies/138663"
        },
        {
            "id": 138660,
            "name": "JavaScript Server",
            "href": "AIP/technologies/138660"
        }
    ],
    "qualityStandards": [
        
    ]
}
