{
    "id": 2351180,
    "name": "ColdFusion: Avoid Functions with high Cyclomatic Complexity",
    "href": "AIP/quality-rules/2351180",
    "critical": false,
    "maxWeight": 6,
    "description": "Avoid Artifacts with High Cyclomatic Complexity (CC greater than X) Cyclomatic Complexity is a measure of the complexity of the control structure of an Artifact. It is the number of linearly independent paths and therefore, the minimum number of independent paths when executing the software. The threshold is a parameter and can be changed at will.",
    "output": "This report lists all Scripts with a Cyclomatic Complexity greater than X. It provides the following information: Script full name, CC",
    "rationale": "The effort and time for diagnosis of deficiencies or causes of failures, or for identification of parts to be modified is directly related to the number of execution paths, i.e. the complexity of the control flow. Analyzability declines with increasing Cyclomatic Complexity. Each modification must be correct for all execution paths. Cyclomatic Complexity computes the number of the linearly independent paths, a lower bound of all execution paths ignoring multiple iterations. Changeability declines with increasing Cyclomatic Complexity. Complete testing requires coverage of all execution paths. Cyclomatic Complexity computes the number of the linearly independent paths, a lower bound of all execution paths ignoring multiple iterations. Testability declines with increasing Cyclomatic Complexity.",
    "reference": "Carnegie Mellon's Software Engineering Institute on Cyclomatic Complexity http://www.sei.cmu.edu/str/descriptions/cyclomatic_body.html NIST (National Institute of Standards and Technology) Structured Testing: A Testing Methodology Using the Cyclomatic Complexity Metric http://hissa.nist.gov/HHRFdata/Artifacts/ITLdoc/235/sttoc.htm",
    "remediation": "Review the design of the Artifact to reduce number of independent paths. E.g.: Reduce the number of conditional statements.",
    "total": "Number of Scripts.",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60011,
            "name": "Transferability",
            "href": "AIP/business-criteria/60011"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61009,
            "name": "Complexity - Algorithmic and Control Structure Complexity",
            "weight": 6,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 2351000,
            "name": "NO LABEL",
            "href": "AIP/technologies/2351000"
        }
    ],
    "qualityStandards": [
        
    ]
}
