{
    "id": 7130,
    "name": "Avoid Artifacts with High Depth of Nested Subqueries",
    "href": "AIP/quality-rules/7130",
    "critical": false,
    "maxWeight": 7,
    "associatedValueName": "Maximum number of SQL Subqueries Nested Levels",
    "description": "This rule list all the artifacts having queries with nested subqueries.\nNested subqueries is measured as the maximum number of nested subqueries in a given artifact. Nested subqueries are subqueries of subqueries.",
    "output": "Associated to each Artifact with violations, the Quality Rule provides:\n- The maximum number of SQL Subqueries Nested Levels",
    "rationale": "Subqueries can possibly cause performance issues. High depth of nested subqueries is a greater source of performance issues.",
    "reference": "http://it-cisq.org/\nCISQ: ASCPEM-PRF-04",
    "remediation": "Review the source code and refactor in order to limit the number of suqueries.",
    "sample": "SELECT column-names\n      FROM table-name1\n     WHERE value IN (SELECT column-name FROM table-name2 \n     WHERE value IN (SELECT column-name  FROM table-name3 \n     WHERE value IN (SELECT column-name  FROM table-name4\n     WHERE value IN (SELECT column-name   FROM table-name5 \n     WHERE condition))))",
    "total": "The total procedure counts the number of SQL Artifacts.",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 7,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 0,
            "name": "ALL TECHNOLOGIES",
            "href": "AIP/technologies/0"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCPEM-PRF-4",
            "name": "Data Resource Read and Write Access Excessive Complexity",
            "url": null,
            "description": null
        },
        {
            "standard": "OWASP",
            "id": "A3-2013",
            "name": "Cross-Site Scripting (XSS)",
            "url": "https://www.owasp.org/index.php/Top_10_2013-A3-Cross-Site_Scripting_(XSS)",
            "description": "XSS flaws occur whenever an application takes untrusted data and sends it to a web browser without proper validation or escaping. XSS allows attackers to execute scripts in the victims' browser which can hijack user sessions, deface web sites, or redirect the user to malicious sites."
        }
    ]
}
