{
    "id": 7344,
    "name": "Avoid \"SELECT *\" queries",
    "href": "AIP/quality-rules/7344",
    "critical": false,
    "maxWeight": 8,
    "associatedValueName": "Number of \"SELECT *\" statements",
    "description": "This metric retrieves the artifacts containing queries using the \"SELECT *\" statement.",
    "output": "Associated to each artifact with violations, the Quality Rule provides: \n- The Number of \"SELECT *\" statements.",
    "rationale": "A query that retrieves all columns of a table with a SELECT * can potentially be the source of important changeability problems. One cannot control how the columns will be ordered and returned to the client. This can lead to important data inconsistencies and thus stability issues.\n\nAlso performance problems may arise when the execution of the query returns a large result sets (many row with all the columns may then become a huge amount of data to transport over the network). Thus optimizer module can't provide a correct execution.",
    "remediation": "Review the design of the query to select only useful Columns",
    "total": "The total procedure counts the number of Client-Server Artifacts using Tables or Views.",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 8,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 0,
            "name": "ALL TECHNOLOGIES",
            "href": "AIP/technologies/0"
        }
    ],
    "qualityStandards": [
        {
            "standard": "AIP",
            "id": "AIP-MIPS-DATA-ACCESS",
            "name": "MIPS Reduction - focus on data access efficiency",
            "url": null,
            "description": "MIPS Reduction assess the level of resources that are wasted on account of sub-optimal coding regarding Efficiency and Robustness areas. Sub-optimal coding regarding Efficiency cause unnecessary consumption of resources, that will ultimately cause unnecessary consumption of electrical power when applications run in production. Sub-optimal coding regarding Robustness cause unnecessary consumption of resources, when it comes down to application shutdown and restart because it failed or because its integrity was corrupted."
        }
    ]
}
