{
    "id": 7490,
    "name": "Avoid UPDATE trigger firing when not necessary",
    "href": "AIP/quality-rules/7490",
    "critical": true,
    "maxWeight": 9,
    "associatedValueName": "Hibernate Entity name",
    "description": "Reports Hibernate Entities that does not set select-before-update property to true and that are associated to a table that fires an UPDATE trigger.",
    "output": "List all Hibernate Entity that don't use select-before-update and that are associated to a table that fires an UPDATE trigger.\n\nIt provides the following information:\n XML File, Hibernate Entity",
    "rationale": "Triggers and object-relational mapping often create issues due to the difficulties of synchronizing the effect of a trigger with the representation of data in memory.\nWhen you are using detached objects associated to a table associated to trigger, Hibernate may execute unnecessary SQL UPDATE statements to ensure that the database state is synchronized with the session state and will affect the performances of your application.",
    "reference": "Hibernate in Action (ISBN 1932394-15-X) p 339\nJava Persistence with Hibernate (ISBN 1-932394-88-5) p 349",
    "remediation": "Use the attribute select-before-update for the persistent class associated to a table that have the UPDATE trigger. This setting forces Hibernate to retrieve a snapshot of the current database state using an SQL SELECT that will enable the subsequent UPDATE to be avoided when the state of the persistent object in the memory is the same.",
    "remediationSample": "---> sample.hbm.xml\n// FIXED\n<class name=\"Sample\" table=\"SAMPLE\"\nselect-before-update=\"true\">\n...\n</class>",
    "sample": "SAMPLE is a table managed by an UPDATE trigger\n---> sample.hbm.xml\n// VIOLATION\n<class name=\"Sample\" table=\"SAMPLE\">\n...\n</class>",
    "total": "Number of Hibernate XML classes associated to a table managed by a trigger",
    "alternativeName": "Ensure to use the attribute select-before-update for the persistent class associated to a table that have the UPDATE trigger in order to not have UPDATE trigger when not necessary",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 9,
            "critical": true
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        98.0,
        99.0,
        99.5,
        99.99
    ]
}
