{
    "id": 7552,
    "name": "Avoid incoherent file accesses in Cobol programs and DISP clauses in JCL",
    "href": "AIP/quality-rules/7552",
    "critical": false,
    "severity": 10,
    "maxWeight": 5,
    "associatedValueName": "JCL step name",
    "description": "This rule searches for Cobol programs that access files in mode that is not coherent with the DISP clause of DD cards defined in JCL job.",
    "output": "Associated to each COBOL File Link with violations, the Quality Rule provides:\n- The JCL step name\n- Bookmarks for violation occurrences found in source code:\n    - The OPEN statement (in the Cobol program) corresponding to the file\n    - The DD card (in the JCL) corresponding to the dataset accessed by the program",
    "rationale": "In a JCL, the DISP parameter of a DD card tells the system what to do with the associated data set in case of normal termination and abnormal termination. The file can be added to or removed from the catalog, passed to the next step, remove after the step execution or after the job execution... If a logical file defined in a COBOL program is linked to this data set via a DD card, then it should be used by respecting the DISP status defined in this DD card. If not, then it is possible that the program write into the file which will be removed just after the step execution. In this specific case the data will be lost and the application will have an abnormal behaviour in production.",
    "remediation": "Check that, in the JCL, the DISP parameter of the DD card associated to the logical file is correctly set compared to the accesses made to the logical file in the program.",
    "total": "Number of Cobol File Links",
    "alternativeName": "Avoid incoherent file accesses in Cobol programs and DISP clauses in JCL",
    "businessCriteria": [
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "AIP/business-criteria/66032"
        },
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61001,
            "name": "Architecture - Multi-Layers and Data Access",
            "href": "AIP/technical-criteria/61001",
            "weight": 5,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": -4,
            "name": "Cobol",
            "href": "AIP/technologies/-4"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
