{
    "id": 7584,
    "name": "Avoid accessing multiple times the same SAP Table or View in an SAP Program (UPDATE)",
    "href": "AIP/quality-rules/7584",
    "critical": false,
    "maxWeight": 3,
    "associatedValueName": "ABAP Table/View accessed multiple times",
    "description": "This metric retrieves the ABAP programs making more than a defined number of accesses to the same database table or view. If a program defines classes, then methods belonging to the first level of classes are taken into account.\nThe number of accesses is a parameter of the rule.",
    "output": "Associated to each ABAP Program with violations, the Quality Rule provides:\n- The ABAP Table/View accessed multiple times",
    "rationale": "For maintainability and performance aspect, avoid making access multiple times to the same database table or view in the same programs.",
    "remediation": "Try to use a common component to make access to the database table or view. The different parts of the program that need to make access to the same database table or view will have to call this component.",
    "total": "Number of ABAP Programs",
    "alternativeName": "Avoid accessing multiple times the same SAP Table or View in an SAP Program (UPDATE)",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61019,
            "name": "Efficiency - SQL and Data Handling Performance",
            "weight": 3,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": -15,
            "name": "ABAP",
            "href": "AIP/technologies/-15"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCMM-MNT-14",
            "name": "Callable and Method Control Element Excessive Number of Control Elements involving Data Element from Data Manager or File Resource",
            "url": null,
            "description": "Objective\nAvoid the existence of control elements with too many data operations\n\nConsequence\nSoftware that does not cap the number of data operations degrades comprehensibility by requiring the understanding of too many external data structures\n\nMeasure Element\nNumber of instances where a named callable control element or method control element has a number of operations involving a data manager or a file resource that exceeds a threshold value. Default threshold value for the number of data operations is 7\n\n"
        }
    ],
    "parameters": [
        {
            "name": "max_acces",
            "description": null,
            "technologies": [
                {
                    "id": 0,
                    "name": "ALL TECHNOLOGIES",
                    "href": "AIP/technologies/0",
                    "values": [
                        2
                    ]
                }
            ]
        }
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
