{
    "id": 7654,
    "name": "Avoid database tables associated to more than one Entity",
    "href": "AIP/quality-rules/7654",
    "critical": false,
    "maxWeight": 9,
    "associatedValueName": "Associated table name",
    "description": "Reports tables associated to more than one Entity except for Entities that belong to the same hierarchy and that are stored into a single table using the table-per-class-hierarchy strategy (also know as SINGLE_TABLE in JPA) or that are stored into several tables using table-per-sub-class strategy (also know as JOINED in JPA).\n\nNote that in the case where two hierarchy are associated to the same table, only the root Entity will be reported, not all the hierarchy.",
    "output": "List all Entities that reference the same table.\nIt provides the following information:\n- Entity Full Name\n- table name",
    "rationale": "One main source of data corruption within applications comes from lack of compliance to data modification rules defined for an application. These rules are usually related to the use of specific procedures for update/insert/delete, a specific API or a data layer that is fully tested to maintain data integrity. The creation of new, different update/insert/delete procedures and functions that do not make use the existing tested code is at origin of many data corruption cases.\nIn the case of Hibernate, having different mapping files associated with the same table is a source of such data corruption.",
    "remediation": "Review your design and decide which Entity must manage the table.",
    "sample": "// VIOLATION: table A is referenced by two Entities\n---> a.hbm.xml\n<class name=\"A\" table=\"A\"> \n    ...  \n</class>\n\n---> b.hbm.xml\n<class name=\"B\" table=\"A\"> \n    ...  \n</class>",
    "total": "Number of entities",
    "businessCriteria": [
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "AIP/business-criteria/66032"
        },
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61001,
            "name": "Architecture - Multi-Layers and Data Access",
            "weight": 9,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
