{
    "id": 7802,
    "name": "Avoid Classes with a High Depth of Inheritance Tree",
    "href": "AIP/quality-rules/7802",
    "critical": false,
    "maxWeight": 6,
    "associatedValueName": "Depth of Inheritance Tree",
    "description": "Avoid Classes and Interfaces with a High Depth of Inheritance Tree (DIT greater than X+1).\nThis means that the inheritance tree should have at most X levels. Depth of Inheritance Tree (DIT) is the maximum length of a path from a class (or interface) to a root class (or root interface) in the inheritance structure of a system. DIT measures how many super-classes can affect a class.",
    "output": "This report lists all Classes and interfaces with a Depth of Inheritance Tree greater than X+1\nIt provides the following information: Class or interface full name, DIT",
    "rationale": "Changing a class (or interface) requires prior understanding, which, in turn, is more complicated for classes (or interface) with many methods. Classes (or interfaces) that are deep down in the classes (or interfaces) hierarchy potentially inherit many methods from super-classes (or super-interfaces). Moreover, the definitions of inherited methods are not local to the class making it even harder to understand it.\n\nComplete testing requires coverage of all execution paths. The number of possible execution paths of a class increases with the number of methods and their control flow complexity. Classes (or interfaces) that are deep down in the classes hierarchy potentially inherit many methods from super-classes (super-interfaces). Due to late binding, super-class (or super-interfaces) methods need to be tested again in the sub-class (or sub-interfaces) context. This makes it potentially harder to test classes (interfaces) deep down in the classes (interfaces) hierarchy.\n\nTechnical or framework classes which are evolving and will not be changed often should not be concerned by this rule.",
    "reference": "https://it-cisq.org/\nCISQ : ASCMM-MNT-17\n\nA Metrics Suite for Object Oriented Design\nChidamber, S.R. and C.F. Kemerer\nIEEE Transactions on Software Engineering, 1994",
    "remediation": "Review the design of the Class hierarchy.",
    "total": "Number of classes and interfaces",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60011,
            "name": "Transferability",
            "href": "AIP/business-criteria/60011"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61010,
            "name": "Complexity - OO Inheritance and Polymorphism",
            "weight": 6,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 141901,
            "name": ".NET (Legacy Analyzer)",
            "href": "AIP/technologies/141901"
        },
        {
            "id": -15,
            "name": "ABAP",
            "href": "AIP/technologies/-15"
        },
        {
            "id": 138383,
            "name": "C#",
            "href": "AIP/technologies/138383"
        },
        {
            "id": -3,
            "name": "C++",
            "href": "AIP/technologies/-3"
        },
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        },
        {
            "id": -8,
            "name": "PowerBuilder",
            "href": "AIP/technologies/-8"
        },
        {
            "id": 138385,
            "name": "VB.NET",
            "href": "AIP/technologies/138385"
        },
        {
            "id": -9,
            "name": "Visual Basic",
            "href": "AIP/technologies/-9"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCMM-MNT-17",
            "name": "Class Element Excessive Inheritance Level",
            "url": null,
            "description": "Objective\nAvoid overly complex object-oriented inheritance capabilities when dealing with the number of levels of inheritance of classes\n\nConsequence\nSoftware that does not follow the principles of reuse requires more maintenance effort in order to propagate changes to all instances of duplicated code\n\nMeasure Element\nNumber of instances where the inheritance level of a class element (that is, the number of parent class units) exceeds a threshold value. The default threshold value for number of inheritance levels is 7\n\n"
        },
        {
            "standard": "STIG-V4R8",
            "id": "STIG-V-70385",
            "name": "The application development team must follow a set of coding standards.",
            "url": null,
            "description": null
        }
    ],
    "parameters": [
        {
            "name": "Maximum Depth of Inheritance Tree",
            "description": "Max Depth Inheritance Tree per class",
            "technologies": [
                {
                    "id": 0,
                    "name": "ALL TECHNOLOGIES",
                    "href": "AIP/technologies/0",
                    "values": [
                        4
                    ]
                }
            ]
        }
    ],
    "thresholds": [
        50.0,
        90.0,
        95.0,
        99.0
    ]
}
