{
    "id": 7936,
    "name": "DEPRECATED: Avoid using finalize()",
    "href": "AIP/quality-rules/7936",
    "critical": true,
    "maxWeight": 8,
    "description": "Report all explicit definition of the method finalize() except when the class has native methods.",
    "output": "The metric will list all methods named finalize that belong to a class that has no native methods\n\nIt provides the following information:\n Method full name",
    "rationale": "When using finalizers, there is no fixed time for finalizers to get executed, which again is JVM dependent: The only thing that is guaranteed is that if at all a finalizer gets executed, it will be before the garbage collector's second cycle. An object may become unreachable and yet its finalizer may not execute for an arbitrarily long time. Nothing of time-critical nature should be run in the finalize method, for instance, closing file handles is not recommended.\n\nIt is possible for the JVM to terminate without invoking the finalizer on an unreachable object. Finalization on process exit is also not guaranteed.\n\nAccording to the Java Language Specification: Section 12.6.2: The Java programming language imposes no ordering on finalize method calls. Finalizers [of different objects] may be called in any order, or even concurrently.\nThis can be a problem as slow running finalizers tend to block others in the queue.\n\nUnintentional mistakes like memory leaks can also cause finalizers to never execute to completion.\n\nA possibility exists such that the programmer unintentionally resurrects the references in the finalize method. While the garbage collector must determine yet again whether the object is free to be deallocated, the finalize method is not invoked again.\n\nA common myth is that finalizers aid garbage collection. On the contrary, they increase garbage collection time and introduce space overheads. They also fail to respect the modern generational garbage collectors. Another trap unfolds while trying to finalize reachable objects, an exercise that is always counterproductive.\n\nSometimes it is necessary to use finalizers especially while working with native objects/code. This is because the garbage collector cannot re-claim memory from code written in another language. Also, the lifetime of the objects is often unknown. Again, the native process must not perform any critical jobs that require immediate resource deallocation.",
    "reference": "Effective Java, 2nd edition, by Joshua Bloch, Addison Wesley. (2008)\nhttps://www.securecoding.cert.org/confluence/display/java/MET12-J.+Do+not+use+finalizers\nhttp://java.sun.com/developer/technicalArticles/javase/finalization",
    "remediation": "When you use an object that you know has native resources associated with it -- for example, a GUI component, file, or socket -- by all means call its dispose() or equivalent method (a method in charge of cleaning resources) when you are finished using it. This will ensure the immediate reclamation of the native resources and decrease the probability of resource depletion.",
    "remediationSample": "public class MyClass  {\n     ...\n      protected void dispose() throws Throwable { // FIXED\n          // some code here\n         ......\n          super.dispose();\n     }\n}",
    "sample": "public class MyClass  {\n     ...\n      protected void finalize() throws Throwable { // VIOLATION\n          // some code here\n         ......\n          super.finalize();\n     }\n}",
    "total": "Number of classes",
    "alternativeName": "Ensure that finalize() is not used as the time of execution is not garanteed",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "AIP/business-criteria/60014"
        },
        {
            "id": 20140522,
            "name": "GreenIT-Index",
            "href": "AIP/business-criteria/20140522"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        },
        {
            "id": 60017,
            "name": "Total Quality Index",
            "href": "AIP/business-criteria/60017"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61018,
            "name": "Efficiency - Memory, Network and Disk Space Management",
            "href": "AIP/technical-criteria/61018",
            "weight": 8
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        98.0,
        99.0,
        99.5,
        99.99
    ]
}
