{
    "id": 8222,
    "name": "CWE-798: Use of hard-coded credentials",
    "href": "AIP/quality-rules/8222",
    "critical": true,
    "associatedValueName": "Call stack from hardcoded string down to the target method",
    "description": "This Quality Rule uses the CAST AIP dataflow engine to detect a call path where a hardcoded credential is sent to a method used for its own inbound authentication, outbound communication to external components or validate the authentication for retrieval of data. \n\nThe list of credential passing methods can be customized.",
    "output": "Lists all methods that call target methods, passing at least one hardcoded credential parameter. \n\nIt provides the following information : \n - Method full name. \n - Call stack with bookmarks from hardcoded credential literal down to the target method.",
    "rationale": "The software should not have hardcoded credentials (username, password) in the application code or files. \nHard-coded credentials typically create a significant security hole that allows an attacker to bypass the authentication that has been configured by the software administrator. \nThis hole might be difficult for the system administrator to detect. Even if detected, it can be difficult to fix, so the administrator may be forced into disabling the product entirely.",
    "reference": "CWE-798: Use of hard-coded credentials\nhttp://cwe.mitre.org/data/definitions/798.html",
    "remediation": "Potential remediations : \n- Outbound authentication : consider storing passwords and keys outside of the code, in the most strongly-protected, encrypted storage. This storage should be protected from outsiders, even other local users from the same system. \n- Inbound authentication : consider using login authentication with strong passwords or keys instead of hardcoding usernames and passwords. \n- If hardcoded credentials cannot be removed, perform access control checks and limit accessed resources.",
    "total": "The number of methods containing credential parameter(s).",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66062,
            "name": "Secure Coding - Input Validation",
            "weight": 9,
            "critical": true
        }
    ],
    "technologies": [
        {
            "id": 138383,
            "name": "C#",
            "href": "AIP/technologies/138383"
        },
        {
            "id": 140029,
            "name": "JEE",
            "href": "AIP/technologies/140029"
        },
        {
            "id": 138385,
            "name": "VB.NET",
            "href": "AIP/technologies/138385"
        }
    ],
    "qualityStandards": [
        {
            "standard": "AIP",
            "id": "AIP-GDPR",
            "name": "General Data Protection Regulation",
            "url": null,
            "description": null
        },
        {
            "standard": "CWE",
            "id": "CWE-798",
            "name": "Use of Hard-coded Credentials",
            "url": "https://cwe.mitre.org/data/definitions/798.html",
            "description": null
        }
    ]
}
