[
    {
        "id": 1061010,
        "name": "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')",
        "description": "The software uses external input to construct a pathname that is intended to identify a file or directory that is located underneath a restricted parent directory, but the software does not properly neutralize special elements within the pathname that can cause the pathname to resolve to a location that is outside of the restricted directory.",
        "href": "AIP/technical-criteria/1061010",
        "weight": 5
    },
    {
        "id": 1061011,
        "name": "CWE-23: Relative Path Traversal",
        "description": "The software uses external input to construct a pathname that should be within a restricted directory, but it does not properly neutralize sequences such as .. that can resolve to a location that is outside of that directory.",
        "href": "AIP/technical-criteria/1061011",
        "weight": 5
    },
    {
        "id": 1061012,
        "name": "CWE-36: Absolute Path Traversal",
        "description": "The software uses external input to construct a pathname that should be within a restricted directory, but it does not properly neutralize absolute path sequences such as /abs/path that can resolve to a location that is outside of that directory.",
        "href": "AIP/technical-criteria/1061012",
        "weight": 5
    },
    {
        "id": 1061013,
        "name": "CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')",
        "description": "The software constructs all or part of a command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended command when it is sent to a downstream component.",
        "href": "AIP/technical-criteria/1061013",
        "weight": 5
    },
    {
        "id": 1061014,
        "name": "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
        "description": "The software constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component.",
        "href": "AIP/technical-criteria/1061014",
        "weight": 5
    },
    {
        "id": 1061015,
        "name": "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')",
        "description": "The software does not neutralize or incorrectly neutralizes user-controllable input before it is placed in output that is used as a web page that is served to other users.",
        "href": "AIP/technical-criteria/1061015",
        "weight": 5
    },
    {
        "id": 1061016,
        "name": "CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')",
        "description": "The software constructs a string for a command to executed by a separate component in another control sphere, but it does not properly delimit the intended arguments, options, or switches within that command string.",
        "href": "AIP/technical-criteria/1061016",
        "weight": 5
    },
    {
        "id": 1061017,
        "name": "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')",
        "description": "The software constructs all or part of an SQL command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended SQL command when it is sent to a downstream component.",
        "href": "AIP/technical-criteria/1061017",
        "weight": 5
    },
    {
        "id": 1061018,
        "name": "CWE-90: Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')",
        "description": "The software constructs all or part of an LDAP query using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended LDAP query when it is sent to a downstream component.",
        "href": "AIP/technical-criteria/1061018",
        "weight": 5
    },
    {
        "id": 1061019,
        "name": "CWE-91: XML Injection (aka Blind XPath Injection)",
        "description": "The software does not properly neutralize special elements that are used in XML, allowing attackers to modify the syntax, content, or commands of the XML before it is processed by an end system.",
        "href": "AIP/technical-criteria/1061019",
        "weight": 5
    },
    {
        "id": 1061020,
        "name": "CWE-99: Improper Control of Resource Identifiers ('Resource Injection')",
        "description": "The software receives input from an upstream component, but it does not restrict or incorrectly restricts the input before it is used as an identifier for a resource that may be outside the intended sphere of control.",
        "href": "AIP/technical-criteria/1061020",
        "weight": 5
    },
    {
        "id": 1061021,
        "name": "CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer",
        "description": "The software performs operations on a memory buffer, but it can read from or write to a memory location that is outside of the intended boundary of the buffer.",
        "href": "AIP/technical-criteria/1061021",
        "weight": 5
    },
    {
        "id": 1061022,
        "name": "CWE-120: Buffer Copy without Checking Size of Input ('Classic Buffer Overflow')",
        "description": "The program copies an input buffer to an output buffer without verifying that the size of the input buffer is less than the size of the output buffer, leading to a buffer overflow.",
        "href": "AIP/technical-criteria/1061022",
        "weight": 5
    },
    {
        "id": 1061023,
        "name": "CWE-123: Write-what-where Condition",
        "description": "Any condition where the attacker has the ability to write an arbitrary value to an arbitrary location, often as the result of a buffer overflow.",
        "href": "AIP/technical-criteria/1061023",
        "weight": 5
    },
    {
        "id": 1061024,
        "name": "CWE-125: Out-of-bounds Read",
        "description": "The software reads data past the end, or before the beginning, of the intended buffer.",
        "href": "AIP/technical-criteria/1061024",
        "weight": 5
    },
    {
        "id": 1061025,
        "name": "CWE-129: Improper Validation of Array Index",
        "description": "The product uses untrusted input when calculating or using an array index, but the product does not validate or incorrectly validates the index to ensure the index references a valid position within the array.",
        "href": "AIP/technical-criteria/1061025",
        "weight": 5
    },
    {
        "id": 1061026,
        "name": "CWE-130: Improper Handling of Length Parameter Inconsistency",
        "description": "The software parses a formatted message or structure, but it does not handle or incorrectly handles a length field that is inconsistent with the actual length of the associated data.",
        "href": "AIP/technical-criteria/1061026",
        "weight": 5
    },
    {
        "id": 1061027,
        "name": "CWE-131: Incorrect Calculation of Buffer Size",
        "description": "The software does not correctly calculate the size to be used when allocating a buffer, which could lead to a buffer overflow.",
        "href": "AIP/technical-criteria/1061027",
        "weight": 5
    },
    {
        "id": 1061028,
        "name": "CWE-134: Use of Externally-Controlled Format String",
        "description": "The software uses a function that accepts a format string as an argument, but the format string originates from an external source.",
        "href": "AIP/technical-criteria/1061028",
        "weight": 5
    },
    {
        "id": 1061029,
        "name": "CWE-170: Improper Null Termination",
        "description": "The software does not terminate or incorrectly terminates a string or array with a null character or equivalent terminator.",
        "href": "AIP/technical-criteria/1061029",
        "weight": 5
    },
    {
        "id": 1061030,
        "name": "CWE-194: Unexpected Sign Extension",
        "description": "The software performs an operation on a number that causes it to be sign extended when it is transformed into a larger data type. When the original number is negative, this can produce unexpected values that lead to resultant weaknesses.",
        "href": "AIP/technical-criteria/1061030",
        "weight": 5
    },
    {
        "id": 1061031,
        "name": "CWE-195: Signed to Unsigned Conversion Error",
        "description": "The software uses a signed primitive and performs a cast to an unsigned primitive, which can produce an unexpected value if the value of the signed primitive can not be represented using an unsigned primitive.",
        "href": "AIP/technical-criteria/1061031",
        "weight": 5
    },
    {
        "id": 1061032,
        "name": "CWE-196: Unsigned to Signed Conversion Error",
        "description": "The software uses an unsigned primitive and performs a cast to a signed primitive, which can produce an unexpected value if the value of the unsigned primitive can not be represented using a signed primitive.",
        "href": "AIP/technical-criteria/1061032",
        "weight": 5
    },
    {
        "id": 1061033,
        "name": "CWE-197: Numeric Truncation Error",
        "description": "Truncation errors occur when a primitive is cast to a primitive of a smaller size and data is lost in the conversion.",
        "href": "AIP/technical-criteria/1061033",
        "weight": 5
    },
    {
        "id": 1061034,
        "name": "CWE-248: Uncaught Exception",
        "description": "An exception is thrown from a function, but it is not caught.",
        "href": "AIP/technical-criteria/1061034",
        "weight": 5
    },
    {
        "id": 1061035,
        "name": "CWE-252: Unchecked Return Value",
        "description": "The software does not check the return value from a method or function, which can prevent it from detecting unexpected states and conditions.",
        "href": "AIP/technical-criteria/1061035",
        "weight": 5
    },
    {
        "id": 1061036,
        "name": "CWE-259: Use of Hard-coded Password",
        "description": "The software contains a hard-coded password, which it uses for its own inbound authentication or for outbound communication to external components.",
        "href": "AIP/technical-criteria/1061036",
        "weight": 5
    },
    {
        "id": 1061037,
        "name": "CWE-321: Use of Hard-coded Cryptographic Key",
        "description": "The use of a hard-coded cryptographic key significantly increases the possibility that encrypted data may be recovered.",
        "href": "AIP/technical-criteria/1061037",
        "weight": 5
    },
    {
        "id": 1061038,
        "name": "CWE-366: Race Condition within a Thread",
        "description": "If two threads of execution use a resource simultaneously, there exists the possibility that resources may be used while invalid, in turn making the state of execution undefined.",
        "href": "AIP/technical-criteria/1061038",
        "weight": 5
    },
    {
        "id": 1061039,
        "name": "CWE-369: Divide By Zero",
        "description": "The product divides a value by zero.",
        "href": "AIP/technical-criteria/1061039",
        "weight": 5
    },
    {
        "id": 1061040,
        "name": "CWE-390: Detection of Error Condition Without Action",
        "description": "The software detects a specific error, but takes no actions to handle the error.",
        "href": "AIP/technical-criteria/1061040",
        "weight": 5
    },
    {
        "id": 1061041,
        "name": "CWE-391: Unchecked Error Condition",
        "description": "[PLANNED FOR DEPRECATION. SEE MAINTENANCE NOTES.] Ignoring exceptions and other error conditions may allow an attacker to induce unexpected behavior unnoticed.",
        "href": "AIP/technical-criteria/1061041",
        "weight": 5
    },
    {
        "id": 1061042,
        "name": "CWE-392: Missing Report of Error Condition",
        "description": "The software encounters an error but does not provide a status code or return value to indicate that an error has occurred.",
        "href": "AIP/technical-criteria/1061042",
        "weight": 5
    },
    {
        "id": 1061043,
        "name": "CWE-394: Unexpected Status Code or Return Value",
        "description": "The software does not properly check when a function or operation returns a value that is legitimate for the function, but is not expected by the software.",
        "href": "AIP/technical-criteria/1061043",
        "weight": 5
    },
    {
        "id": 1061044,
        "name": "CWE-401: Missing Release of Memory after Effective Lifetime",
        "description": "The software does not sufficiently track and release allocated memory after it has been used, which slowly consumes remaining memory.",
        "href": "AIP/technical-criteria/1061044",
        "weight": 5
    },
    {
        "id": 1061045,
        "name": "CWE-404: Improper Resource Shutdown or Release",
        "description": "The program does not release or incorrectly releases a resource before it is made available for re-use.",
        "href": "AIP/technical-criteria/1061045",
        "weight": 5
    },
    {
        "id": 1061046,
        "name": "CWE-407: Inefficient Algorithmic Complexity",
        "description": "An algorithm in a product has an inefficient worst-case computational complexity that may be detrimental to system performance and can be triggered by an attacker, typically using crafted manipulations that ensure that the worst case is being reached.",
        "href": "AIP/technical-criteria/1061046",
        "weight": 5
    },
    {
        "id": 1061047,
        "name": "CWE-415: Double Free",
        "description": "The product calls free() twice on the same memory address, potentially leading to modification of unexpected memory locations.",
        "href": "AIP/technical-criteria/1061047",
        "weight": 5
    },
    {
        "id": 1061048,
        "name": "CWE-416: Use After Free",
        "description": "Referencing memory after it has been freed can cause a program to crash, use unexpected values, or execute code.",
        "href": "AIP/technical-criteria/1061048",
        "weight": 5
    },
    {
        "id": 1061049,
        "name": "CWE-424: Improper Protection of Alternate Path",
        "description": "The product does not sufficiently protect all possible paths that a user can take to access restricted functionality or resources.",
        "href": "AIP/technical-criteria/1061049",
        "weight": 5
    },
    {
        "id": 1061050,
        "name": "CWE-434: Unrestricted Upload of File with Dangerous Type",
        "description": "The software allows the attacker to upload or transfer files of dangerous types that can be automatically processed within the product's environment.",
        "href": "AIP/technical-criteria/1061050",
        "weight": 5
    },
    {
        "id": 1061051,
        "name": "CWE-456: Missing Initialization of a Variable",
        "description": "The software does not initialize critical variables, which causes the execution environment to use unexpected values.",
        "href": "AIP/technical-criteria/1061051",
        "weight": 5
    },
    {
        "id": 1061052,
        "name": "CWE-457: Use of Uninitialized Variable",
        "description": "The code uses a variable that has not been initialized, leading to unpredictable or unintended results.",
        "href": "AIP/technical-criteria/1061052",
        "weight": 5
    },
    {
        "id": 1061053,
        "name": "CWE-459: Incomplete Cleanup",
        "description": "The software does not properly clean up and remove temporary or supporting resources after they have been used.",
        "href": "AIP/technical-criteria/1061053",
        "weight": 5
    },
    {
        "id": 1061054,
        "name": "CWE-476: NULL Pointer Dereference",
        "description": "A NULL pointer dereference occurs when the application dereferences a pointer that it expects to be valid, but is NULL, typically causing a crash or exit.",
        "href": "AIP/technical-criteria/1061054",
        "weight": 5
    },
    {
        "id": 1061055,
        "name": "CWE-477: Use of Obsolete Function",
        "description": "The code uses deprecated or obsolete functions, which suggests that the code has not been actively reviewed or maintained.",
        "href": "AIP/technical-criteria/1061055",
        "weight": 5
    },
    {
        "id": 1061056,
        "name": "CWE-478: Missing Default Case in Switch Statement",
        "description": "The code does not have a default case in a switch statement, which might lead to complex logical errors and resultant weaknesses.",
        "href": "AIP/technical-criteria/1061056",
        "weight": 5
    },
    {
        "id": 1061057,
        "name": "CWE-480: Use of Incorrect Operator",
        "description": "The programmer accidentally uses the wrong operator, which changes the application logic in security-relevant ways.",
        "href": "AIP/technical-criteria/1061057",
        "weight": 5
    },
    {
        "id": 1061058,
        "name": "CWE-484: Omitted Break Statement in Switch",
        "description": "The program omits a break statement within a switch or similar construct, causing code associated with multiple conditions to execute. This can cause problems when the programmer only intended to execute code associated with one condition.",
        "href": "AIP/technical-criteria/1061058",
        "weight": 5
    },
    {
        "id": 1061059,
        "name": "CWE-502: Deserialization of Untrusted Data",
        "description": "The application deserializes untrusted data without sufficiently verifying that the resulting data will be valid.",
        "href": "AIP/technical-criteria/1061059",
        "weight": 5
    },
    {
        "id": 1061060,
        "name": "CWE-543: Use of Singleton Pattern Without Synchronization in a Multithreaded Context",
        "description": "The software uses the singleton pattern when creating a resource within a multithreaded environment.",
        "href": "AIP/technical-criteria/1061060",
        "weight": 5
    },
    {
        "id": 1061061,
        "name": "CWE-561: Dead Code",
        "description": "The software contains dead code, which can never be executed.",
        "href": "AIP/technical-criteria/1061061",
        "weight": 5
    },
    {
        "id": 1061062,
        "name": "CWE-562: Return of Stack Variable Address",
        "description": "A function returns the address of a stack variable, which will cause unintended program behavior, typically in the form of a crash.",
        "href": "AIP/technical-criteria/1061062",
        "weight": 5
    },
    {
        "id": 1061063,
        "name": "CWE-564: SQL Injection: Hibernate",
        "description": "Using Hibernate to execute a dynamic SQL statement built with user-controlled input can allow an attacker to modify the statement's meaning or to execute arbitrary SQL commands.",
        "href": "AIP/technical-criteria/1061063",
        "weight": 5
    },
    {
        "id": 1061064,
        "name": "CWE-567: Unsynchronized Access to Shared Data in a Multithreaded Context",
        "description": "The product does not properly synchronize shared data, such as static variables across threads, which can lead to undefined behavior and unpredictable data changes.",
        "href": "AIP/technical-criteria/1061064",
        "weight": 5
    },
    {
        "id": 1061065,
        "name": "CWE-570: Expression is Always False",
        "description": "The software contains an expression that will always evaluate to false.",
        "href": "AIP/technical-criteria/1061065",
        "weight": 5
    },
    {
        "id": 1061066,
        "name": "CWE-571: Expression is Always True",
        "description": "The software contains an expression that will always evaluate to true.",
        "href": "AIP/technical-criteria/1061066",
        "weight": 5
    },
    {
        "id": 1061067,
        "name": "CWE-595: Comparison of Object References Instead of Object Contents",
        "description": "The program compares object references instead of the contents of the objects themselves, preventing it from detecting equivalent objects.",
        "href": "AIP/technical-criteria/1061067",
        "weight": 5
    },
    {
        "id": 1061068,
        "name": "CWE-597: Use of Wrong Operator in String Comparison",
        "description": "The product uses the wrong operator when comparing a string, such as using == when the equals() method should be used instead.",
        "href": "AIP/technical-criteria/1061068",
        "weight": 5
    },
    {
        "id": 1061069,
        "name": "CWE-606: Unchecked Input for Loop Condition",
        "description": "The product does not properly check inputs that are used for loop conditions, potentially leading to a denial of service or other consequences because of excessive looping.",
        "href": "AIP/technical-criteria/1061069",
        "weight": 5
    },
    {
        "id": 1061070,
        "name": "CWE-611: Improper Restriction of XML External Entity Reference",
        "description": "The software processes an XML document that can contain XML entities with URIs that resolve to documents outside of the intended sphere of control, causing the product to embed incorrect documents into its output.",
        "href": "AIP/technical-criteria/1061070",
        "weight": 5
    },
    {
        "id": 1061072,
        "name": "CWE-643: Improper Neutralization of Data within XPath Expressions ('XPath Injection')",
        "description": "The software uses external input to dynamically construct an XPath expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
        "href": "AIP/technical-criteria/1061072",
        "weight": 5
    },
    {
        "id": 1061073,
        "name": "CWE-652: Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')",
        "description": "The software uses external input to dynamically construct an XQuery expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
        "href": "AIP/technical-criteria/1061073",
        "weight": 5
    },
    {
        "id": 1061074,
        "name": "CWE-662: Improper Synchronization",
        "description": "The software utilizes multiple threads or processes to allow temporary access to a shared resource that can only be exclusive to one process at a time, but it does not properly synchronize these actions, which might cause simultaneous accesses of this resource by multiple threads or processes.",
        "href": "AIP/technical-criteria/1061074",
        "weight": 5
    },
    {
        "id": 1061075,
        "name": "CWE-665: Improper Initialization",
        "description": "The software does not initialize or incorrectly initializes a resource, which might leave the resource in an unexpected state when it is accessed or used.",
        "href": "AIP/technical-criteria/1061075",
        "weight": 5
    },
    {
        "id": 1061076,
        "name": "CWE-667: Improper Locking",
        "description": "The software does not properly acquire or release a lock on a resource, leading to unexpected resource state changes and behaviors.",
        "href": "AIP/technical-criteria/1061076",
        "weight": 5
    },
    {
        "id": 1061077,
        "name": "CWE-672: Operation on a Resource after Expiration or Release",
        "description": "The software uses, accesses, or otherwise operates on a resource after that resource has been expired, released, or revoked.",
        "href": "AIP/technical-criteria/1061077",
        "weight": 5
    },
    {
        "id": 1061078,
        "name": "CWE-681: Incorrect Conversion between Numeric Types",
        "description": "When converting from one data type to another, such as long to integer, data can be omitted or translated in a way that produces unexpected values. If the resulting values are used in a sensitive context, then dangerous behaviors may occur.",
        "href": "AIP/technical-criteria/1061078",
        "weight": 5
    },
    {
        "id": 1061079,
        "name": "CWE-682: Incorrect Calculation",
        "description": "The software performs a calculation that generates incorrect or unintended results that are later used in security-critical decisions or resource management.",
        "href": "AIP/technical-criteria/1061079",
        "weight": 5
    },
    {
        "id": 1061080,
        "name": "CWE-703: Improper Check or Handling of Exceptional Conditions",
        "description": "The software does not properly anticipate or handle exceptional conditions that rarely occur during normal operation of the software.",
        "href": "AIP/technical-criteria/1061080",
        "weight": 5
    },
    {
        "id": 1061081,
        "name": "CWE-704: Incorrect Type Conversion or Cast",
        "description": "The software does not correctly convert an object, resource, or structure from one type to a different type.",
        "href": "AIP/technical-criteria/1061081",
        "weight": 5
    },
    {
        "id": 1061082,
        "name": "CWE-732: Incorrect Permission Assignment for Critical Resource",
        "description": "The product specifies permissions for a security-critical resource in a way that allows that resource to be read or modified by unintended actors.",
        "href": "AIP/technical-criteria/1061082",
        "weight": 5
    },
    {
        "id": 1061083,
        "name": "CWE-758: Reliance on Undefined, Unspecified, or Implementation-Defined Behavior",
        "description": "The software uses an API function, data structure, or other entity in a way that relies on properties that are not always guaranteed to hold for that entity.",
        "href": "AIP/technical-criteria/1061083",
        "weight": 5
    },
    {
        "id": 1061084,
        "name": "CWE-764: Multiple Locks of a Critical Resource",
        "description": "The software locks a critical resource more times than intended, leading to an unexpected state in the system.",
        "href": "AIP/technical-criteria/1061084",
        "weight": 5
    },
    {
        "id": 1061085,
        "name": "CWE-772: Missing Release of Resource after Effective Lifetime",
        "description": "The software does not release a resource after its effective lifetime has ended, i.e., after the resource is no longer needed.",
        "href": "AIP/technical-criteria/1061085",
        "weight": 5
    },
    {
        "id": 1061086,
        "name": "CWE-775: Missing Release of File Descriptor or Handle after Effective Lifetime",
        "description": "The software does not release a file descriptor or handle after its effective lifetime has ended, i.e., after the file descriptor/handle is no longer needed.",
        "href": "AIP/technical-criteria/1061086",
        "weight": 5
    },
    {
        "id": 1061087,
        "name": "CWE-778: Insufficient Logging",
        "description": "When a security-critical event occurs, the software either does not record the event or omits important details about the event when logging it.",
        "href": "AIP/technical-criteria/1061087",
        "weight": 5
    },
    {
        "id": 1061088,
        "name": "CWE-783: Operator Precedence Logic Error",
        "description": "The program uses an expression in which operator precedence causes incorrect logic to be used.",
        "href": "AIP/technical-criteria/1061088",
        "weight": 5
    },
    {
        "id": 1061089,
        "name": "CWE-786: Access of Memory Location Before Start of Buffer",
        "description": "The software reads or writes to a buffer using an index or pointer that references a memory location prior to the beginning of the buffer.",
        "href": "AIP/technical-criteria/1061089",
        "weight": 5
    },
    {
        "id": 1061090,
        "name": "CWE-787: Out-of-bounds Write",
        "description": "The software writes data past the end, or before the beginning, of the intended buffer.",
        "href": "AIP/technical-criteria/1061090",
        "weight": 5
    },
    {
        "id": 1061091,
        "name": "CWE-788: Access of Memory Location After End of Buffer",
        "description": "The software reads or writes to a buffer using an index or pointer that references a memory location after the end of the buffer.",
        "href": "AIP/technical-criteria/1061091",
        "weight": 5
    },
    {
        "id": 1061092,
        "name": "CWE-789: Uncontrolled Memory Allocation",
        "description": "The product allocates memory based on an untrusted size value, but it does not validate or incorrectly validates the size, allowing arbitrary amounts of memory to be allocated.",
        "href": "AIP/technical-criteria/1061092",
        "weight": 5
    },
    {
        "id": 1061093,
        "name": "CWE-798: Use of Hard-coded Credentials",
        "description": "The software contains hard-coded credentials, such as a password or cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data.",
        "href": "AIP/technical-criteria/1061093",
        "weight": 5
    },
    {
        "id": 1061094,
        "name": "CWE-805: Buffer Access with Incorrect Length Value",
        "description": "The software uses a sequential operation to read or write a buffer, but it uses an incorrect length value that causes it to access memory that is outside of the bounds of the buffer.",
        "href": "AIP/technical-criteria/1061094",
        "weight": 5
    },
    {
        "id": 1061095,
        "name": "CWE-820: Missing Synchronization",
        "description": "The software utilizes a shared resource in a concurrent manner but does not attempt to synchronize access to the resource.",
        "href": "AIP/technical-criteria/1061095",
        "weight": 5
    },
    {
        "id": 1061096,
        "name": "CWE-821: Incorrect Synchronization",
        "description": "The software utilizes a shared resource in a concurrent manner, but it does not correctly synchronize access to the resource.",
        "href": "AIP/technical-criteria/1061096",
        "weight": 5
    },
    {
        "id": 1061097,
        "name": "CWE-822: Untrusted Pointer Dereference",
        "description": "The program obtains a value from an untrusted source, converts this value to a pointer, and dereferences the resulting pointer.",
        "href": "AIP/technical-criteria/1061097",
        "weight": 5
    },
    {
        "id": 1061098,
        "name": "CWE-823: Use of Out-of-range Pointer Offset",
        "description": "The program performs pointer arithmetic on a valid pointer, but it uses an offset that can point outside of the intended range of valid memory locations for the resulting pointer.",
        "href": "AIP/technical-criteria/1061098",
        "weight": 5
    },
    {
        "id": 1061099,
        "name": "CWE-824: Access of Uninitialized Pointer",
        "description": "The program accesses or uses a pointer that has not been initialized.",
        "href": "AIP/technical-criteria/1061099",
        "weight": 5
    },
    {
        "id": 1061100,
        "name": "CWE-825: Expired Pointer Dereference",
        "description": "The program dereferences a pointer that contains a location for memory that was previously valid, but is no longer valid.",
        "href": "AIP/technical-criteria/1061100",
        "weight": 5
    },
    {
        "id": 1061101,
        "name": "CWE-833: Deadlock",
        "description": "The software contains multiple threads or executable segments that are waiting for each other to release a necessary lock, resulting in deadlock.",
        "href": "AIP/technical-criteria/1061101",
        "weight": 5
    },
    {
        "id": 1061102,
        "name": "CWE-835: Loop with Unreachable Exit Condition ('Infinite Loop')",
        "description": "The program contains an iteration or loop with an exit condition that cannot be reached, i.e., an infinite loop.",
        "href": "AIP/technical-criteria/1061102",
        "weight": 5
    },
    {
        "id": 1061103,
        "name": "CWE-908: Use of Uninitialized Resource",
        "description": "The software uses or accesses a resource that has not been initialized.",
        "href": "AIP/technical-criteria/1061103",
        "weight": 5
    },
    {
        "id": 1061104,
        "name": "CWE-917: Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')",
        "description": "The software constructs all or part of an expression language (EL) statement in a Java Server Page (JSP) using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended EL statement before it is executed.",
        "href": "AIP/technical-criteria/1061104",
        "weight": 5
    },
    {
        "id": 1061105,
        "name": "CWE-1041: Use of Redundant Code",
        "description": "The software has multiple functions, methods, procedures, macros, etc. that contain the same code.",
        "href": "AIP/technical-criteria/1061105",
        "weight": 5
    },
    {
        "id": 1061106,
        "name": "CWE-1042: Static Member Data Element outside of a Singleton Class Element",
        "description": "The code contains a member element that is declared as static (but not final), in which its parent class element is not a singleton class - that is, a class element that can be used only once in the 'to' association of a Create action.",
        "href": "AIP/technical-criteria/1061106",
        "weight": 5
    },
    {
        "id": 1061107,
        "name": "CWE-1043: Data Element Aggregating an Excessively Large Number of Non-Primitive Elements",
        "description": "The software uses a data element that has an excessively large number of sub-elements with non-primitive data types such as structures or aggregated objects.",
        "href": "AIP/technical-criteria/1061107",
        "weight": 5
    },
    {
        "id": 1061108,
        "name": "CWE-1045: Parent Class with a Virtual Destructor and a Child Class without a Virtual Destructor",
        "description": "A parent class has a virtual destructor method, but the parent has a child class that does not have a virtual destructor.",
        "href": "AIP/technical-criteria/1061108",
        "weight": 5
    },
    {
        "id": 1061109,
        "name": "CWE-1046: Creation of Immutable Text Using String Concatenation",
        "description": "The software creates an immutable text string using string concatenation operations.",
        "href": "AIP/technical-criteria/1061109",
        "weight": 5
    },
    {
        "id": 1061110,
        "name": "CWE-1047: Modules with Circular Dependencies",
        "description": "The software contains modules in which one module has references that cycle back to itself, i.e., there are circular dependencies.",
        "href": "AIP/technical-criteria/1061110",
        "weight": 5
    },
    {
        "id": 1061111,
        "name": "CWE-1048: Invokable Control Element with Large Number of Outward Calls",
        "description": "The code contains callable control elements that contain an excessively large number of references to other application objects external to the context of the callable, i.e. a Fan-Out value that is excessively large.",
        "href": "AIP/technical-criteria/1061111",
        "weight": 5
    },
    {
        "id": 1061112,
        "name": "CWE-1049: Excessive Data Query Operations in a Large Data Table",
        "description": "The software performs a data query with a large number of joins and sub-queries on a large data table.",
        "href": "AIP/technical-criteria/1061112",
        "weight": 5
    },
    {
        "id": 1061113,
        "name": "CWE-1050: Excessive Platform Resource Consumption within a Loop",
        "description": "The software has a loop body or loop condition that contains a control element that directly or indirectly consumes platform resources, e.g. messaging, sessions, locks, or file descriptors.",
        "href": "AIP/technical-criteria/1061113",
        "weight": 5
    },
    {
        "id": 1061114,
        "name": "CWE-1051: Initialization with Hard-Coded Network Resource Configuration Data",
        "description": "The software initializes data using hard-coded values that act as network resource identifiers.",
        "href": "AIP/technical-criteria/1061114",
        "weight": 5
    },
    {
        "id": 1061115,
        "name": "CWE-1052: Excessive Use of Hard-Coded Literals in Initialization",
        "description": "The software initializes a data element using a hard-coded literal that is not a simple integer or static constant element.",
        "href": "AIP/technical-criteria/1061115",
        "weight": 5
    },
    {
        "id": 1061116,
        "name": "CWE-1054: Invocation of a Control Element at an Unnecessarily Deep Horizontal Layer",
        "description": "The code at one architectural layer invokes code that resides at a deeper layer than the adjacent layer, i.e., the invocation skips at least one layer, and the invoked code is not part of a vertical utility layer that can be referenced from any horizontal layer.",
        "href": "AIP/technical-criteria/1061116",
        "weight": 5
    },
    {
        "id": 1061117,
        "name": "CWE-1055: Multiple Inheritance from Concrete Classes",
        "description": "The software contains a class with inheritance from more than one concrete class.",
        "href": "AIP/technical-criteria/1061117",
        "weight": 5
    },
    {
        "id": 1061118,
        "name": "CWE-1057: Data Access Operations Outside of Expected Data Manager Component",
        "description": "The software uses a dedicated, central data manager component as required by design, but it contains code that performs data-access operations that do not use this data manager.",
        "href": "AIP/technical-criteria/1061118",
        "weight": 5
    },
    {
        "id": 1061119,
        "name": "CWE-1058: Invokable Control Element in Multi-Thread Context with non-Final Static Storable or Member Element",
        "description": "The code contains a function or method that operates in a multi-threaded environment but owns an unsafe non-final static storable or member data element.",
        "href": "AIP/technical-criteria/1061119",
        "weight": 5
    },
    {
        "id": 1061120,
        "name": "CWE-1060: Excessive Number of Inefficient Server-Side Data Accesses",
        "description": "The software performs too many data queries without using efficient data processing functionality such as stored procedures.",
        "href": "AIP/technical-criteria/1061120",
        "weight": 5
    },
    {
        "id": 1061121,
        "name": "CWE-1062: Parent Class with References to Child Class",
        "description": "The code has a parent class that contains references to a child class, its methods, or its members.",
        "href": "AIP/technical-criteria/1061121",
        "weight": 5
    },
    {
        "id": 1061122,
        "name": "CWE-1064: Invokable Control Element with Signature Containing an Excessive Number of Parameters",
        "description": "The software contains a function, subroutine, or method whose signature has an unnecessarily large number of parameters/arguments.",
        "href": "AIP/technical-criteria/1061122",
        "weight": 5
    },
    {
        "id": 1061123,
        "name": "CWE-1066: Missing Serialization Control Element",
        "description": "The software contains a serializable data element that does not have an associated serialization method.",
        "href": "AIP/technical-criteria/1061123",
        "weight": 5
    },
    {
        "id": 1061124,
        "name": "CWE-1067: Excessive Execution of Sequential Searches of Data Resource",
        "description": "The software contains a data query against an SQL table or view that is configured in a way that does not utilize an index and may cause sequential searches to be performed.",
        "href": "AIP/technical-criteria/1061124",
        "weight": 5
    },
    {
        "id": 1061125,
        "name": "CWE-1070: Serializable Data Element Containing non-Serializable Item Elements",
        "description": "The software contains a serializable, storable data element such as a field or member, but the data element contains member elements that are not serializable.",
        "href": "AIP/technical-criteria/1061125",
        "weight": 5
    },
    {
        "id": 1061126,
        "name": "CWE-1072: Data Resource Access without Use of Connection Pooling",
        "description": "The software accesses a data resource through a database without using a connection pooling capability.",
        "href": "AIP/technical-criteria/1061126",
        "weight": 5
    },
    {
        "id": 1061127,
        "name": "CWE-1073: Non-SQL Invokable Control Element with Excessive Number of Data Resource Accesses",
        "description": "The software contains a client with a function or method that contains a large number of data accesses/queries that are sent through a data manager, i.e., does not use efficient database capabilities.",
        "href": "AIP/technical-criteria/1061127",
        "weight": 5
    },
    {
        "id": 1061128,
        "name": "CWE-1074: Class with Excessively Deep Inheritance",
        "description": "A class has an inheritance level that is too high, i.e., it has a large number of parent classes.",
        "href": "AIP/technical-criteria/1061128",
        "weight": 5
    },
    {
        "id": 1061129,
        "name": "CWE-1075: Unconditional Control Flow Transfer outside of Switch Block",
        "description": "The software performs unconditional control transfer (such as a goto) in code outside of a branching structure such as a switch block.",
        "href": "AIP/technical-criteria/1061129",
        "weight": 5
    },
    {
        "id": 1061130,
        "name": "CWE-1077: Floating Point Comparison with Incorrect Operator",
        "description": "The code performs a comparison such as an equality test between two float (floating point) values, but it uses comparison operators that do not account for the possibility of loss of precision.",
        "href": "AIP/technical-criteria/1061130",
        "weight": 5
    },
    {
        "id": 1061131,
        "name": "CWE-1079: Parent Class without Virtual Destructor Method",
        "description": "A parent class contains one or more child classes, but the parent class does not have a virtual destructor method.",
        "href": "AIP/technical-criteria/1061131",
        "weight": 5
    },
    {
        "id": 1061132,
        "name": "CWE-1080: Source Code File with Excessive Number of Lines of Code",
        "description": "A source code file has too many lines of code.",
        "href": "AIP/technical-criteria/1061132",
        "weight": 5
    },
    {
        "id": 1061133,
        "name": "CWE-1082: Class Instance Self Destruction Control Element",
        "description": "The code contains a class instance that calls the method or function to delete or destroy itself.",
        "href": "AIP/technical-criteria/1061133",
        "weight": 5
    },
    {
        "id": 1061134,
        "name": "CWE-1083: Data Access from Outside Expected Data Manager Component",
        "description": "The software is intended to manage data access through a particular data manager component such as a relational or non-SQL database, but it contains code that performs data access operations without using that component.",
        "href": "AIP/technical-criteria/1061134",
        "weight": 5
    },
    {
        "id": 1061135,
        "name": "CWE-1084: Invokable Control Element with Excessive File or Data Access Operations",
        "description": "A function or method contains too many operations that utilize a data manager or file resource.",
        "href": "AIP/technical-criteria/1061135",
        "weight": 5
    },
    {
        "id": 1061136,
        "name": "CWE-1085: Invokable Control Element with Excessive Volume of Commented-out Code",
        "description": "A function, method, procedure, etc. contains an excessive amount of code that has been commented out within its body.",
        "href": "AIP/technical-criteria/1061136",
        "weight": 5
    },
    {
        "id": 1061137,
        "name": "CWE-1086: Class with Excessive Number of Child Classes",
        "description": "A class contains an unnecessarily large number of children.",
        "href": "AIP/technical-criteria/1061137",
        "weight": 5
    },
    {
        "id": 1061138,
        "name": "CWE-1087: Class with Virtual Method without a Virtual Destructor",
        "description": "A class contains a virtual method, but the method does not have an associated virtual destructor.",
        "href": "AIP/technical-criteria/1061138",
        "weight": 5
    },
    {
        "id": 1061139,
        "name": "CWE-1088: Synchronous Access of Remote Resource without Timeout",
        "description": "The code has a synchronous call to a remote resource, but there is no timeout for the call, or the timeout is set to infinite.",
        "href": "AIP/technical-criteria/1061139",
        "weight": 5
    },
    {
        "id": 1061140,
        "name": "CWE-1089: Large Data Table with Excessive Number of Indices",
        "description": "The software uses a large data table that contains an excessively large number of indices.",
        "href": "AIP/technical-criteria/1061140",
        "weight": 5
    },
    {
        "id": 1061141,
        "name": "CWE-1090: Method Containing Access of a Member Element from Another Class",
        "description": "A method for a class performs an operation that directly accesses a member element from another class.",
        "href": "AIP/technical-criteria/1061141",
        "weight": 5
    },
    {
        "id": 1061142,
        "name": "CWE-1091: Use of Object without Invoking Destructor Method",
        "description": "The software contains a method that accesses an object but does not later invoke the element's associated finalize/destructor method.",
        "href": "AIP/technical-criteria/1061142",
        "weight": 5
    },
    {
        "id": 1061144,
        "name": "CWE-1094: Excessive Index Range Scan for a Data Resource",
        "description": "The software contains an index range scan for a large data table, but the scan can cover a large number of rows.",
        "href": "AIP/technical-criteria/1061144",
        "weight": 5
    },
    {
        "id": 1061145,
        "name": "CWE-1095: Loop Condition Value Update within the Loop",
        "description": "The software uses a loop with a control flow condition based on a value that is updated within the body of the loop.",
        "href": "AIP/technical-criteria/1061145",
        "weight": 5
    },
    {
        "id": 1061146,
        "name": "CWE-1096: Singleton Class Instance Creation without Proper Locking or Synchronization",
        "description": "The software implements a Singleton design pattern but does not use appropriate locking or other synchronization mechanism to ensure that the singleton class is only instantiated once.",
        "href": "AIP/technical-criteria/1061146",
        "weight": 5
    },
    {
        "id": 1061147,
        "name": "CWE-1097: Persistent Storable Data Element without Associated Comparison Control Element",
        "description": "The software uses a storable data element that does not have all of the associated functions or methods that are necessary to support comparison.",
        "href": "AIP/technical-criteria/1061147",
        "weight": 5
    },
    {
        "id": 1061148,
        "name": "CWE-1098: Data Element containing Pointer Item without Proper Copy Control Element",
        "description": "The code contains a data element with a pointer that does not have an associated copy or constructor method.",
        "href": "AIP/technical-criteria/1061148",
        "weight": 5
    },
    {
        "id": 1061149,
        "name": "CWE-1121: Excessive McCabe Cyclomatic Complexity",
        "description": "The code contains McCabe cyclomatic complexity that exceeds a desirable maximum.",
        "href": "AIP/technical-criteria/1061149",
        "weight": 5
    }
]
