[
    {
        "id": 66032,
        "name": "Architectural Design",
        "description": "Architectural Design",
        "href": "AIP/business-criteria/66032"
    },
    {
        "id": 1062100,
        "name": "CISQ-Index",
        "description": "The mission of the Consortium for Information & Software Quality (CISQ) is to develop international standards to automate software quality measurement and to promote the development and sustainment of secure, reliable, and trustworthy software.",
        "href": "AIP/business-criteria/1062100"
    },
    {
        "id": 60012,
        "name": "Changeability",
        "description": "Changeability measures how easily applications can be modified in order to implement new features, correct errors, or change the applications environment.",
        "href": "AIP/business-criteria/60012"
    },
    {
        "id": 66033,
        "name": "Documentation",
        "description": "Documentation",
        "href": "AIP/business-criteria/66033"
    },
    {
        "id": 60014,
        "name": "Efficiency",
        "description": "Efficiency measures the likelihood of potential performance bottlenecks and the potential future scalability issues linked to coding practices.",
        "href": "AIP/business-criteria/60014"
    },
    {
        "id": 20140522,
        "name": "GreenIT-Index",
        "description": "Green IT index assess the level of resources that are wasted on account of sub-optimal coding regarding Efficiency and Robustness areas. \nSub-optimal coding regarding Efficiency cause unnecessary consumption of resources, that will ultimately cause unnecessary consumption of electrical power when applications run in production.\nSub-optimal coding regarding Robustness cause unnecessary consumption of resources, when it comes down to application shutdown and restart because it failed or because its integrity was corrupted.",
        "href": "AIP/business-criteria/20140522"
    },
    {
        "id": 1061000,
        "name": "ISO-5055-Index",
        "description": "ISO 5055 (formally labelled ISO/IEC 5055) is an ISO standard for measuring the internal structure of a software product on four business-critical factors: Security, Reliability, Performance Efficiency, and Maintainability",
        "href": "AIP/business-criteria/1061000"
    },
    {
        "id": 1062200,
        "name": "MIPS-Reduction-Index",
        "description": null,
        "href": "AIP/business-criteria/1062200"
    },
    {
        "id": 1062300,
        "name": "OWASP-2013-Index",
        "description": "OWASP Top 10 most critical security risks to web applications - 2013",
        "href": "AIP/business-criteria/1062300"
    },
    {
        "id": 1062320,
        "name": "OWASP-2017-Index",
        "description": "OWASP Top 10 most critical security risks to web applications - 2017",
        "href": "AIP/business-criteria/1062320"
    },
    {
        "id": 66031,
        "name": "Programming Practices",
        "description": "Programming Practices",
        "href": "AIP/business-criteria/66031"
    },
    {
        "id": 60013,
        "name": "Robustness",
        "description": "Robustness measures the level of risk and the likelihood of having application failures and application defects due to modifications. Robustness measures as well the level of effort necessary to test the application",
        "href": "AIP/business-criteria/60013"
    },
    {
        "id": 60016,
        "name": "Security",
        "description": "Security measures the likelihood of potential security breaches linked to coding practices and application source code.",
        "href": "AIP/business-criteria/60016"
    },
    {
        "id": 60017,
        "name": "Total Quality Index",
        "description": "Total Quality Index measures the general maintainability level of the application based on hundreds of metrics provided by CAST.",
        "href": "AIP/business-criteria/60017"
    },
    {
        "id": 60011,
        "name": "Transferability",
        "description": "Transferability measures how easily applications can be moved across teams or team members including in-house and outsourced development teams.",
        "href": "AIP/business-criteria/60011"
    }
]
