{
    "id": "STIG-V-222602",
    "name": "The application must protect from Cross-Site Scripting (XSS) vulnerabilities.",
    "href": "CARL/quality-standards/STIG-V5/items/STIG-V-222602",
    "url": "https://www.stigviewer.com/stig/application_security_and_development/2020-09-30/finding/V-222602",
    "description": "XSS attacks are essentially code injection attacks against the various language interpreters contained within the browser. XSS can be executed via HTML, JavaScript, VBScript, ActiveX; essentially any scripting language a browser is capable of processing.\n\nXSS vulnerabilities are created when a website does not properly sanitize, escape, or encode user input. For example, \"&lt;\" is the HTML encoding for the \"<\" character. If the encoding is performed, the script code will not execute.\n\nThere are 3 parties involved in an XSS attack, the attacker, the trusted and vulnerable website, and the victim. An attacker will take advantage of a vulnerable website that does not properly validate user input by inserting malicious code into any data entry field.\n\nWhen the victim visits the trusted website and clicks on the malicious link left by the attacker, the attacker’s script is executed in the victims browser with the trust permissions assigned to the site.\n\nThere are several different types of XSS attack and the complete details regarding XSS cannot be described completely here.\n\nTo address the issue of XSS, web application developers must escape, encode or otherwise validate all user input that is processed and output by the web server. They should also use web templates or a web development framework that provides the capability to encode or otherwise validate user input.\n\nExamples of XSS vulnerabilities can be obtained from the Open Web Application Security Project (OWASP) website.\n  \nThe site is available by pointing your browser to https://www.owasp.org.",
    "isoPatterns": null,
    "count": 48,
    "qualityRules": {
        "name": "Quality Rules in numeric ID order",
        "href": "CARL/quality-standards/STIG-V5/items/STIG-V-222602/quality-rules"
    }
}
