[
    {
        "id": "STIG-V-69249",
        "name": "The application must display an explicit logoff message to users indicating the reliable termination of authenticated communications sessions.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69249",
        "count": 0
    },
    {
        "id": "STIG-V-69301",
        "name": "The application must automatically disable accounts after a 35 day period of account inactivity.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69301",
        "count": 0
    },
    {
        "id": "STIG-V-69313",
        "name": "The application must notify System Administrators and Information System Security Officers when accounts are created.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69313",
        "count": 0
    },
    {
        "id": "STIG-V-69315",
        "name": "The application must notify System Administrators and Information System Security Officers when accounts are modified.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69315",
        "count": 0
    },
    {
        "id": "STIG-V-69317",
        "name": "The application must notify System Administrators and Information System Security Officers of account disabling actions.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69317",
        "count": 0
    },
    {
        "id": "STIG-V-69319",
        "name": "The application must notify System Administrators and Information System Security Officers of account removal actions.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69319",
        "count": 0
    },
    {
        "id": "STIG-V-69323",
        "name": "The application must notify System Administrators and Information System Security Officers of account enabling actions.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69323",
        "count": 0
    },
    {
        "id": "STIG-V-69349",
        "name": "The application must display the Standard Mandatory DoD Notice and Consent Banner before granting access to the application.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69349",
        "count": 0
    },
    {
        "id": "STIG-V-69351",
        "name": "The application must retain the Standard Mandatory DoD Notice and Consent Banner on the screen until users acknowledge the usage conditions and take explicit actions to log on for further access.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69351",
        "count": 0
    },
    {
        "id": "STIG-V-69353",
        "name": "The publicly accessible application must display the Standard Mandatory DoD Notice and Consent Banner before granting access to the application.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69353",
        "count": 0
    },
    {
        "id": "STIG-V-69355",
        "name": "The application must display the time and date of the users last successful logon.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-69355",
        "count": 0
    },
    {
        "id": "STIG-V-70173",
        "name": "The application must have a process, feature or function that prevents removal or disabling of emergency accounts. ",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70173",
        "count": 0
    },
    {
        "id": "STIG-V-70287",
        "name": "The application must notify the ISSO and ISSM of failed security verification tests.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70287",
        "count": 0
    },
    {
        "id": "STIG-V-70367",
        "name": "Prior to each release of the application, updates to system, or applying patches; tests plans and procedures must be created and executed.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70367",
        "count": 0
    },
    {
        "id": "STIG-V-70373",
        "name": "Test procedures must be created and at least annually executed to ensure system initialization, shutdown, and aborts are configured to verify the system remains in a secure state.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70373",
        "count": 0
    },
    {
        "id": "STIG-V-70377",
        "name": "Code coverage statistics must be maintained for each release of the application.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70377",
        "count": 0
    },
    {
        "id": "STIG-V-70385",
        "name": "The application development team must follow a set of coding standards.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70385",
        "count": 0
    },
    {
        "id": "STIG-V-70387",
        "name": "The designer must create and update the Design Document for each release of the application.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70387",
        "count": 0
    },
    {
        "id": "STIG-V-70399",
        "name": "Procedures must be in place to notify users when an application is decommissioned.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70399",
        "count": 0
    },
    {
        "id": "STIG-V-70417",
        "name": "At least one application administrator must be registered to receive update notifications, or security alerts, when automated alerts are available.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70417",
        "count": 0
    },
    {
        "id": "STIG-V-70419",
        "name": "The application must provide notifications or alerts when product update and security related patches are available.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70419",
        "count": 0
    },
    {
        "id": "STIG-V-70423",
        "name": "The application must generate audit records when concurrent logons from different workstations occur.",
        "href": "AIP/quality-standards/STIG-V4R8/items/STIG-V-70423",
        "count": 0
    }
]
