{
    "id": 1002238,
    "type": "quality-rule",
    "name": "Avoid untested Return Code variables after Read or Write in Programs (FORTRAN)",
    "href": "quality-rules/1002238.json",
    "critical": false,
    "maxWeight": 1,
    "description": "The IOSTAT usage in a read, write or open operation are causing the analysis to create specific variables where the return code is stored in. Whenever this variable is not used in any IF construct , the artifact is reported as a violation. The proper order in which this needs to take place is not taken into account; only the artifacts that have no testing of IOSTAT variables are captured by this diagnostic.",
    "rationale": "The variable that contains the IOSTAT return code value must be tested to ensure properly handling of any errors in the read/write that may have occurred. Dont assume that the operation is successful.",
    "reference": "IOSTAT= ios  is an input/output status specifier that specifies the status of the input/output operation. ios is a scalar variable. When the input/output statement containing this specifier finishes execution, ios is defined with: A zero value if no error condition occurs. A positive value if an error occurs.",
    "remediation": "Make sure that all variables containing the return code value for a read, write or open opetation are actually tested to make sure the these operations are successful or not.",
    "businessCriteria": [
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "business-criteria/20140522.json"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "business-criteria/66031.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "business-criteria/60016.json"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61014,
            "name": "Programming Practices - Error and Exception Handling",
            "weight": 1,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1006000,
            "name": "Fortran",
            "href": "technologies/1006000.json"
        }
    ],
    "qualityStandards": [
        
    ]
}
