{
    "id": 7136,
    "type": "quality-rule",
    "name": "Each method in an Action Class should have a small complexity",
    "href": "quality-rules/7136.json",
    "critical": false,
    "maxWeight": 4,
    "associatedValueName": "Cyclomatic Complexity",
    "description": "Each method in an Action Class (and inherited methods) that are referenced in the struts-config.xml through the tag 'action-mapping' (in struts 1.x) or in struts.xml and its included files through the tag 'action' (in struts 2.x) should have a small cyclomatic complexity.",
    "output": "This report lists all Action methods with Cyclomatic complexity greater than X\nIt provides the following information:\n - Action Method full name\n - Cyclomatic Complexity",
    "rationale": "It is wise to avoid creating lengthy and complex Action classes. If you start to embed too much logic in the Action class itself, you will begin to find the Action class hard to understand, maintain, and impossible to reuse. Rather than creating overly complex Action classes, it is generally a good practice to move most of the persistence, and \"business logic\" to a separate application layer.\nCyclomatic Complexity equals the minimum number of tests to check the Action Class's behavior. High CC means more testing and higher risk of errors.",
    "reference": "http://struts.apache.org/1.x/userGuide/building_controller.html",
    "remediation": "Refactor your application architecture and move some of this logic to another conceptual layer; otherwise, you may be left with an inflexible application which can only be accessed in a web-application environment.",
    "total": "The number of methods of classes and parent classes that are referenced as an action in the XML configuration file.",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "business-criteria/60012.json"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "business-criteria/66031.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 60011,
            "name": "Transferability",
            "href": "business-criteria/60011.json"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61009,
            "name": "Complexity - Algorithmic and Control Structure Complexity"
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "technologies/140029.json"
        }
    ],
    "qualityStandards": [
        
    ]
}
