{
    "id": 1007018,
    "type": "quality-rule",
    "name": "Avoid Classes with High Cyclomatic Complexity (PHP)",
    "href": "quality-rules/1007018.json",
    "description": "This rule searches for all classes with High Cyclomatic Complexity.\n          Cyclomatic Complexity is a measure of the complexity of the control structure of an artifact. It is the number of linearly independent paths and also the minimum number of independent paths while executing the software. \n          The threshold is a parameter and can be changed as per requirement.",
    "output": "This report lists all classes with a High Cyclomatic Complexity.\n\nThis QR provides the following information:\nClass full name.",
    "rationale": "Cyclomatic Complexity computes the number of linearly independent paths and a lower boundary of all execution paths ignoring multiple iterations.\n      \nThe effort and time for diagnosis of deficiencies or causes of failures, or for\nidentification of parts to be modified is directly related to the number of execution paths, i.e. the\ncomplexity of the control flow.\n\nAnalyzability, changeability and testability decreases with increasing Cyclomatic Complexity.\n\nEach modification must be correct for all execution paths. \nComplete testing requires coverage of all execution paths.",
    "remediation": "Modify the source code to reduce the number of classes with a High Cyclomatic Complexity.",
    "total": "Number of classes",
    "businessCriteria": [
        {
            "id": 60011,
            "name": "Transferability",
            "href": "business-criteria/60011.json"
        },
        {
            "id": 60012,
            "name": "Changeability",
            "href": "business-criteria/60012.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "business-criteria/66031.json"
        }
    ],
    "technologies": [
        {
            "id": 1017000,
            "name": "PHP",
            "href": "technologies/1017000.json"
        }
    ],
    "qualityStandards": [
        
    ]
}
