{
    "id": 1600106,
    "type": "quality-rule",
    "name": "PeopleSoft: Avoid using the SqlExec statements in the PeopleCode",
    "href": "quality-rules/1600106.json",
    "associatedValueName": "Number of SqlExec",
    "description": "Only the use of the SqlExec is checked here.\nFor data corruption, the use of insert, delete, update, commit statements should be also checked",
    "output": "Failed checks gives the number of objects that contain a call to the SqlExec function",
    "rationale": "The SqlExec function allows to execute a SQL statement inside PeopleCode and is oftenly use by developers because they only need to copy the query.\nThe SqlExec function has some limitations:\n-limited to 1000 characters\n-possible data corruption because it directly impacts the database\n-the server is queried for each call\n-only get one line\n-SQL code is static. If the table structure change, you need to rewrite it\n-it doesn't handle the multi-langage\nImpacts are:\n-performance: it only gets one line if the query contains a join. If the query returns more than one line, only the first one is used but the query execution is for all rows\n-maintenance: during upgrade and maintain, the SQL strings is considered a black box. If field names or table names change during an upgrade, table and field references within the SQL string are not updated automatically. For these reasons, you should use a SQL definition and the meta-SQL statements provided in PeopleTools 8.0\n-development: the multi-langage is not handled by the framework. The join must be written by the developer",
    "reference": "2.3",
    "remediation": "To get one full data row for a table, use the SQL object or the Record class enable in version 8.4. \n- The Record class enables to instanciate tables not in the component processor and to execute every DML operation DML (update, insert or delete).  \n- The SQL object is dedicated to the SELECT statement.\nTo get more than one row, use functions CreateSQL, GetSQL or Fetch.\nThe use of ScrollSelect or the use of a method Select on a Rowset object enables to read lines from a Scroll.\nThe record name in the SQL SELECT must be in uppercas. For example: select 'X' from PS_AE_STMT_B_TBL where ...;",
    "remediationSample": "&rs = CreateRowset (record.PS_S1_ITM_LD_CP_EC);\n&NbEnregLus = &rs.fill ( \"WHERE A.EIP_CTL_ID LIKE 'R%' and S1_NUM_LOT = :1 AND ((:2 = 'OUI' AND :1  = 0) OR (:2 <> 'OUI' AND :1  = 0) OR (:2 <> 'OUI' AND :1  = A.S1_NUM_LOT))\",S1_ITM_VAR_AET.S1_NUM_LOT, S1_RUNCNTL_AET.S1_TOPINIT_CD );",
    "sample": "SQLExec(\"SELECT count(*) FROM PS_S1_ITM_LD_CP_EC A WHERE A.EIP_CTL_ID LIKE 'R%' and S1_NUM_LOT = :1 AND ((:2 = 'OUI' AND :1  = 0) OR (:2 <> 'OUI' AND :1  = 0) OR (:2 <> 'OUI' AND :1  = A.S1_NUM_LOT))\", S1_ITM_VAR_AET.S1_NUM_LOT , S1_RUNCNTL_AET.S1_TOPINIT_CD , &NbEnregLus);",
    "total": "Number of PeopleSoft Events, Functions and Methods",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "business-criteria/60012.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "business-criteria/60016.json"
        },
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "business-criteria/66032.json"
        }
    ],
    "technologies": [
        {
            "id": 1600000,
            "name": "PeopleSoft",
            "href": "technologies/1600000.json"
        }
    ]
}
