{
    "id": 7126,
    "type": "quality-rule",
    "name": "Avoid Artifacts with high Commented-out Code Lines/Code Lines ratio",
    "href": "quality-rules/7126.json",
    "associatedValueName": "Ratio of Commented-out Code Lines / Code Lines",
    "description": "Commented-out Code Lines/Code Lines ratio measures the amount of code left in comments versus the size of the source code (excluding comments and blank lines) this is done for a given artifact.\n\nPlease note that unless the following criteria are met by the source code, then the metric will be disabled: \n- the source code must contain more than 20 \"clean\" comments \n- the source code must contain at least 80 artifacts that have more than 10 lines of code \n\nWhat is a \"clean\" comment? \n- if the comment contains more than 4 words, then there must be less than 40% OOVs \n- if the comment contains less than 5 words, then there must be a maximum of 1 OOV \n- A single word on its own must not represent 50% of the comment \n\nWhat is an \"OOV\"? \n- an \"OOV\" is an \"Out of Vocabulary Word\". With regard to CAST, an OOV is a word that has never appeared in the code.",
    "output": "Associated to each artifact with violations, the Quality Rule provides: \n- The Ratio of Commented-out Code Lines / Code Lines",
    "rationale": "Commented-out code makes source code much more difficult to read and understand. Indeed, when too much source code is commented out, the valid executable code is easily lost in the sea of comments and it becomes very difficult to locate and read the real source code. This is the reason why it should be avoided as much as possible.\nThis measure also helps evaluate the comments that are, in fact, used for documentation purposes.",
    "reference": "CISQ rule: ASCMM-MNT-6.",
    "total": "The total procedure counts the number of Artifacts.",
    "businessCriteria": [
        {
            "id": 60011,
            "name": "Transferability",
            "href": "business-criteria/60011.json"
        },
        {
            "id": 66033,
            "name": "Documentation",
            "href": "business-criteria/66033.json"
        }
    ],
    "technologies": [
        {
            "id": 0,
            "name": "ALL TECHNOLOGIES",
            "href": "technologies/0.json"
        }
    ]
}
