{
    "id": 7156,
    "type": "quality-rule",
    "name": "Avoid Too Many Copy Pasted Artifacts",
    "href": "quality-rules/7156.json",
    "associatedValueName": "Associated Value",
    "description": "This metric measures the ratio between the number of duplicated, copy/pasted artifacts and the total number of artifacts.\n\nCopy / Paste detection is based on statistical detection methods. The statistical methods used compute a similarity metric between all artifacts. Artifacts are reported as copy / pasted when the similarity is higher than 90% (see metric parameter SIMILARITY).\nLike any statistical method, the detection algorithms require a well sized sample in order to provide significant results: testing these algorithms with a couple of classes will not do the job, a real life application's source code is required to yield usable results. The minimal size required stands at around 5000 lines of code.\nBelow such a size, the algorithms detect the full list of exact copies for the copy/paste code detection but slightly modified copy/paste code will not always be detected.\nAlso, for optimal efficiency, the copy/pasted code detection is enabled only for artifacts larger than 10 lines of code (methods, functions, procedures, triggers, programs...).",
    "rationale": "A program with a lot of duplication is hard to change. It might be required to change every copy of a copy/pasted code while it is very difficult to locate these  copy/pasted code elements. Copy-and-paste is not always bad for a quick urgent \"hack\", but it is always a very dangerous practice in the long run.",
    "reference": "CISQ rule: ASCMM-MNT-19.",
    "total": "Artifacts larger than 10 lines of code ( default value of the CODELINE parameter )",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "business-criteria/60012.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "business-criteria/66032.json"
        }
    ],
    "technologies": [
        {
            "id": 0,
            "name": "ALL TECHNOLOGIES",
            "href": "technologies/0.json"
        }
    ]
}
