{
    "id": 7292,
    "type": "quality-rule",
    "name": "Avoid cyclical calls and inheritances between packages",
    "href": "quality-rules/7292.json",
    "critical": true,
    "associatedValueName": "Cyclically called / inherited Package full name",
    "description": "This metric reports all packages that have one-on-one and more static circular dependencies.\nDependencies mean:\n - references through static methods call\n - references through class fields\n - references through inheritance\n\nNote that all these links are static link and not runtime.\nThe threshold parameter permit to define the maximal number of packages to cross for a cycle.\n\nNote that cycle notion means here a directed path in a graph that is directed by dependencies relations.",
    "output": "This report lists all packages with static cyclical call to or inheritance with another Java Package.\nIt provides the following information:\n  - Package full name\n  - cyclically called / inherited Package full name",
    "rationale": "When two packages refer to each other through a call, the result is a circular dependency. Neither packages can function without the other, and so neither is reusable without the other. In some cases redesign may eliminate these dependencies.\nWhen circular references are necessary, redesign it to ensure reusability. The same problem happen when some classes from a package A inherit from classes of a package B and other classes from package B inherit from other classes from package A. This rule can be extended to circular dependencies for more than 2 packages (for example a package A call a package B that call a package C, that call package A).",
    "reference": "http://en.wikipedia.org/wiki/Circular_dependency",
    "remediation": "If there are circular relationships among packages, the partitioning is not clear and should be redesigned. Use CAST Enlighten to see all dependencies to fix.",
    "total": "Total number of packages",
    "businessCriteria": [
        {
            "id": 60012,
            "name": "Changeability",
            "href": "business-criteria/60012.json"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "business-criteria/60013.json"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "business-criteria/60016.json"
        },
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "business-criteria/66032.json"
        }
    ],
    "technologies": [
        {
            "id": 140029,
            "name": "JEE",
            "href": "technologies/140029.json"
        }
    ],
    "qualityStandards": [
        {
            "standard": "CISQ",
            "id": "ASCMM-MNT-13",
            "name": "Callable and Method Control Element Excessive Number of Parameters",
            "reference": null,
            "description": null
        },
        {
            "standard": "CISQ",
            "id": "ASCMM-MNT-7",
            "name": "Inter-Module Dependency Cycles",
            "reference": null,
            "description": null
        }
    ]
}
