{
    "id": 7530,
    "type": "quality-rule",
    "name": "Avoid \"SELECT *\" or \"SELECT SINGLE *\" queries",
    "href": "quality-rules/7530.json",
    "associatedValueName": "Number of queries containing \"SELECT *\" or \"SELECT SINGLE *\"",
    "description": "This metric retrieves the ABAP artifacts containing queries using the \"SELECT *\" or \"SELECT SINGLE *\" statement.\nIt is possible to specify some tables as exceptions by setting them in the parameters of the rule (you can specify complete names, ex: USR02 or generic names by using '%' character, ex: T% or BUT%).",
    "output": "Associated to each ABAP Artifact with violations, the Quality Rule provides:\n- The number of queries containing \"SELECT *\" or \"SELECT SINGLE *\"",
    "rationale": "A query that retrieves all columns of a table with a SELECT *  or SELECT SINGLE * can potentially be the source of important performance problems:\nSuch performance problems may arise when the execution of the query returns a large result sets (many row with all the columns may then become a huge amount of data to transport over the network). However, there are some exceptions with standard tables such as parameter tables. \n\nAlso, when using such queries, one cannot control how the columns will be ordered and returned to the client. This can lead to important data inconsistencies and thus stability issues.",
    "remediation": "Limit the number of field selected by naming those which are expecting only.",
    "total": "Number of ABAP Artifacts containing OpenSQL queries.",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "business-criteria/60014.json"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "business-criteria/66031.json"
        }
    ],
    "technologies": [
        {
            "id": -15,
            "name": "ABAP",
            "href": "technologies/-15.json"
        }
    ]
}
