{
    "id": 7538,
    "type": "quality-rule",
    "name": "Avoid using SELECT ... INTO CORRESPONDING FIELDS OF",
    "href": "quality-rules/7538.json",
    "associatedValueName": "Number of violation patterns",
    "description": "This metric retrieves all ABAP Artifacts using SELECT ...  INTO CORRESPONDING FIELDS OF statement on tables and views.",
    "output": "Associated to each ABAP Artifact with violations, the Quality Rule provides:\n- The number of violation patterns",
    "rationale": "The INTO CORRESPONDING FIELDS option must be avoided as this option of the SELECT statement places the result set in the work area line by line. As mentioned in the book \"Enhancing the Quality of ABAP Development\", to accomplish this: \"All field values from each table row are selected and transported to the application server first. Then the fields that are required are copied to the work area fields with the same name...Try to limit this type of programming to test programs or use it only for those tables that contain a limited number of fields. Generally, the preferred option, regarding both performance and maintenance, is to explicitly name the fields to be selected.\"",
    "reference": "Enhancing the Quality of ABAP Development, \nMeijs-Krouwels-Heulmans-Sommen, SAP Press\nISBN 1-59229-030-2\nPage 302",
    "remediation": "Generally, the preferred option, regarding both performance and maintenance, is to explicitly name the fields to be selected.",
    "total": "Number of ABAP Artifacts using SAP Tables and SAP Views.",
    "businessCriteria": [
        {
            "id": 60014,
            "name": "Efficiency",
            "href": "business-criteria/60014.json"
        },
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "business-criteria/66031.json"
        },
        {
            "id": 20140522,
            "name": "Green Stuff",
            "href": "business-criteria/20140522.json"
        }
    ],
    "technologies": [
        {
            "id": -15,
            "name": "ABAP",
            "href": "technologies/-15.json"
        }
    ],
    "qualityStandards": [
        
    ]
}
