[
    {
        "name": "AIP",
        "href": "CARL/quality-standards/AIP",
        "count": 981,
        "description": null
    },
    {
        "name": "C-CPP",
        "href": "CARL/quality-standards/C-CPP",
        "count": 67,
        "description": "C and C++ languages quality standards"
    },
    {
        "name": "CISQ",
        "href": "CARL/quality-standards/CISQ",
        "count": 315,
        "description": "The mission of the Consortium for Information & Software Quality (CISQ) is to develop international standards to automate software quality measurement and to promote the development and sustainment of secure, reliable, and trustworthy software."
    },
    {
        "name": "CWE",
        "href": "CARL/quality-standards/CWE",
        "count": 653,
        "description": "CWE (Common Weakness Enumeration) is a community-developed list of software and hardware weakness types. It serves as a common language, a measuring stick for security tools, and as a baseline for weakness identification, mitigation, and prevention efforts."
    },
    {
        "name": "ISO-5055",
        "href": "CARL/quality-standards/ISO-5055",
        "count": 355,
        "description": "ISO 5055 (formally labelled ISO/IEC 5055) is an ISO standard for measuring the internal structure of a software product on four business-critical factors: Security, Reliability, Performance Efficiency, and Maintainability"
    },
    {
        "name": "NIST-SP-800-53R4",
        "href": "CARL/quality-standards/NIST-SP-800-53R4",
        "count": 312,
        "description": "This standard provides a catalog of security and privacy controls for federal information systems and organizations and a process for selecting controls to protect organizational operations (including mission, functions, image, and reputation), organizational assets, individuals, other organizations, and the Nation from a diverse set of threats including hostile cyber attacks, natural disasters, structural failures, and human errors (both intentional and unintentional)"
    },
    {
        "name": "OMG-ASCQM",
        "href": "CARL/quality-standards/OMG-ASCQM",
        "count": 348,
        "description": "OMG Automated Source Code Quality Measures index computes Quality Software Characteristics Measure as Business Criteria and Quality Measure Elements as Technical Criteria. The OMG-ASCQM standard is a CISQ consortium submission."
    },
    {
        "name": "OWASP",
        "href": "CARL/quality-standards/OWASP",
        "count": 379,
        "description": "The Open Web Application Security Project (OWASP) is a nonprofit foundation that works to improve the security of software. Through community-led open-source software projects, hundreds of local chapters worldwide, tens of thousands of members, and leading educational and training conferences, the OWASP Foundation is the source for developers and technologists to secure the web."
    },
    {
        "name": "PCI-DSS-V3.1",
        "href": "CARL/quality-standards/PCI-DSS-V3.1",
        "count": 444,
        "description": "The PCI Security Standards Council is an open global forum for the ongoing development, enhancement, storage, dissemination and implementation of security standards for account data protection."
    },
    {
        "name": "PCI-DSS-V3.2.1",
        "href": "CARL/quality-standards/PCI-DSS-V3.2.1",
        "count": 444,
        "description": "The PCI Security Standards Council is an open global forum for the ongoing development, enhancement, storage, dissemination and implementation of security standards for account data protection."
    },
    {
        "name": "STIG-V5",
        "href": "CARL/quality-standards/STIG-V5",
        "count": 211,
        "description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents."
    }
]
